{"pages":[{"title":"404 Page Not Here","text":"The page your are looking for has been abducted by aliens and is being ass probed right now. More than likely the link has changed. You can try checking the homepage or archives If you are hotlinking any files or images from this website, unfortunately I do not allow such. Some pretty things can be found here too","link":"/404.html"},{"title":"About","text":"Each part sold separately. Batteries not included. This page should be something about something Something about OmgLulz.WTF Genius Slacker House Gangster Food Mafia Professional Dota 2 Feeder Fat Bastarad Tech Triad PC, Keyboard and Car Pimp Destroy It Youself (DIY) Elite Stingy Bastard If for some odd reason, the website does not work well in IE it’s because this site has issues with Internet Explorer. They don’t like each other. I do not plan to fix any IE issues because let’s face it Internet explorer is not the most used internet browser around.","link":"/about/index.html"},{"title":"My Photo Gallery","text":"Some of the photos I took with my X-T10. I mostly shoot random street, garage and car photos.","link":"/gallery/index.html"},{"title":"search","text":"","link":"/search/index.html"},{"title":"Typing Videos","text":"Youtube video collection of all my mechanical keyboard typing videos and different keycaps. I will be adding to this list, if I get new keyboards. I know videos will be small but you can always have it played back in youtube. I just wanted to post a separate page for this because I’ve gotten a few requests from people. It would also be easier to find the videos here but if you need more info about the keyboard or the keycaps, you can always check my posts about the certain keyboard/keycap combo.","link":"/typing-videos/index.html"}],"posts":[{"title":"AutoArt 1:18 Custom AE86","text":"Have had this for quite sometime now but have always forgotten to share it here. I have a custom AutoArt AE86 in 1/18 scale model. I like collecting weird shit (yeah for an adult to own toys is quite weird) and collecting diecast models is one of them. I really don’t go into the small models because I feel like I miss out on the details if I go with the smaller scale models. This AE86 has been custom’d with Watanabe Wheels Lowered and stanced If I had the money for an AE86, I sure would love to have it look the same as this scale model. Sharing photos and hope you like it","link":"/AutoArt-1-18-Custom-AE86/"},{"title":"BSD &#x3D; Unilimited Headache","text":"I started out my linux adventures via slackware linux. Now I am using the easiest way out Linux Mint just because I am getting old and when you get old there are a lot of things you best spend your time on. Back then everyone was playing with their redhat and I insisted that I wanted something out of the box. I still remember my happy mother when I ask her to buy me a book that was so thick and was quite expensive. It was a Linux for dummies book because I wanted to learn how to use the operating system and internet back then was a real pain in the ass. Google was not yet conceived so there was really not much for me to get the information from. When I started with slackware I can still remember the 2 drives that died on me during the process for installing, removing, re-installing, partition, re-partition but I did learn a few bits here and there. Back then linux package management was not yet the thing. You have to download and compile including the dependencies for a program to be installed in slackware. Fast forward this year, I got bored and said to myself that I really want to try and learn a fair bit of BSD. So I downloaded the iso and for testing purposes installed it in a virtual machine (thank God for the people who created those things). Yep it was a pain but using it brings back the slackware days during my younger years. Make, make install, tar etc etc. It’s only now that I understood what it meant by slackware is most unix like linux distro. So I guess having experience with slackware did help me with playing around with BSD. I did have some old hardware I was planning to use BSD on and use the machine as my home server but unfortunately life is hard nowadays and I don’t really have the extra means to buy western digital red nas drives. Maybe in time I can learn more about bsd and the infamous file system they are using and be able to apply it on my home server but for now I will play around with it inside the virtual box. I might be able to score some cheap 250gb hdd soon and use that as my main bsd drive and dual boot the desktop. For people who want to venture into BSD, I would suggest you read up the Freebsd manual its really quite good and has a lot of information. Let’s face it if you have no experience with BSD the first thing that will come to your mind would be FreeBSD. Be prepared for the unlimited headache you will get though, chances are some of your hardware requires a lot of configuring to do. Some of your linux application might not have been ported to FreeBSD. You might need to compile one on your own.","link":"/BSD-Unilimited-Headache/"},{"title":"Back to my roots Cooler Master Masterkeys Pro S","text":"I recently sold my mx black quickfire rapid because I found a good deal for RGB TKL specifically the CM Masterkeys Pro S. I thought store prices from local shops in Malaysia was quite absurd. I tried going the Lazada way it was cheaper yeah but it was still way out of my budget. I decided to check the local online shop that started before Lazada even happend.. Lelong.com.my and I did find a very nice deal for the price including shipping. I could have driven and picked it up from the shop in Klang but decided I’de pay the extra 10 bucks which will still save me petrol and toll gate costs. I have to say board feels nice but I still like how my 2 old quickfires looked specifically the top case. This one is a tad bit more lighter and also the feel is so much plastic unlike the old QFR’s. The cherry mx brown is quite nice though and the colors are good for an RGB board. Like many others that I have read online, it seems like the keys on this keyboard have some small high pitched pinging sound. For my keyboard it would be the F1, F2 and F3 keys. I also dislike the stupid cherry stabilizers. It is not because I got used the costart stabilizers on my old QFR’s. I have a pok3r which uses the same cherry stabilizers and they do not feel as mushy as the one’s installed on the masterkeys. The pok3r stabs also feel much better and stable than the one’s on this keyboard. I did compare the stabilizers from this board with my Ganss GK87 pro keyboard and CM seriously needs to work on their stabilizer game if they want to compete with the growing mechanical keyboard market. Another thing to note is the sound of the clacks on this keyboard. My pok3r 3 is on a tex aluminum case and it the clacks really sound solid. The clacks on the Masterkeys Pro S really sound different. It’s like the keyboard is so hollow inside. I tried to watch and read reviews about the keyboard online and most if not call of them fail to mention my qualms about the keyboard but all in all I like the board itself. I also uploaded a video of the keyboard showing the Spectograph feature on youtube (see below) PS I cant finish the whole song so that youtube will not take out the audio.","link":"/Back-to-my-roots-Cooler-Master-Masterkeys-Pro-S/"},{"title":"Been A While","text":"It’s been a while since I last posted…. Well been very busy with real life and a few things came up, far more important things I needed to a attend to (i.e. business) Since the last updates with keycool and my SA profile keycaps. I have long since sold most of my SA keysets with the exception of Carbon SA. Well I tried to sell it but someone backed out and I told myself I’d rather keep it seeing how the prices are going down because of Carbon SA Round 2 coming up. I might as well keep my set and buy the extra kits that I need to make it compatible with all keyboard layouts. I have also been getting a few DSA keycaps sets and found out that I do have an unused DSA Granite Elven Kit in my stock room that I have totally forgot about. So I might be testing out this profile with my new KBD75 build since the I feel the SA profile does not feel really that well with the board and also my SA Carbon does not have all the correct keycaps to fill up the board correctly. I will be posting multiple updates today about whats happening with my keyboard scene.","link":"/Been-A-While/"},{"title":"Bugatti si Real.. TNC wins WESG","text":"The Bugatti dream continues to be real for TNC as then won the recently concluded WESG tournament beating Cloud 9 2-1. Damn these boys are now legit millionaires specially Kuku. After placing in the Top 8 last year in the International. Now the team has finished at the top of WESG with a $800,000 prize money. See the winning moment below","link":"/Bugatti-si-Real-TNC-wins-k/"},{"title":"CM Quickfire Rapid + GMK Carbon Keycaps","text":"I decided to install the GMK Carbon keycaps on my QFR board (the one I repainted a few months back). For some reason the mods or dark colored caps show up as black in the photos but believe me they are really dark grey with orange legends. And I think orange, grey, blue go together. The caps did considerably lessen the noise for my MX Blacks (well they were not really noisy to begin with) but because this are thick ABS the sound level actually went down compared to ABS keycaps. I posted a video (check my previous post) on how this board sounds like with OEM QFS ABS keycaps. All in all I am happy with the puchase Cooler Master Quickfire Rapid GMK Carbon","link":"/CM-Quickfire-Rapid-GMK-Carbon-Keycaps/"},{"title":"CM Storm Quickfire Rapid on SA Carbon","text":"Not sure if this works well but I think the color of the board matches the carbon or I might be wrong. I am thinking of repainting my board but still lazy right now considering I only want to change it because of the Carbon SA keycaps that I have while all the other keycap sets that I have matches the color on it right now. Any how if you are reading this you might want to give me suggestions about the color for the board to match the set. Thanks","link":"/CM-Storm-Quickfire-Rapid-on-SA-Carbon/"},{"title":"CM Storm Quickfire Rapid on SA Nantucket Selectrics","text":"Whenever I have new keysets that arrive. I always test them out first on my old buy reliable 5 year old QFR. I’de like to test it out with my MX Blacks since I primarily use this keyboard for work. All I have to say is that they made my stiff black switches softer. Even my office colleague who have type on this keyboard had the same opinion. He never really like cherry mx black because it was too stiff for him but he said with the SA profile keycaps, he can probably get used to it. Not sue why but maybe because of the higher profile which means a bit less travel to press the keys and also it makes pressing the keys very satisfying. I had 2 sets of add-on or some sort of novelties when I ordered my set it was really a struggle for me to choose which setup I would like to use and most of the time the problem is that you would want to use all the keys as much as possible. Check out the album below and maybe let me know what you guys think?","link":"/CM-Storm-Quickfire-Rapid-on-SA-Nantucket-Selectrics/"},{"title":"CM Storm Quickfire Rapid on SA PuLse","text":"I cycle thru my keycap collection from time to time. Last week I had this keeb for the rest of the week. Sharing how PuLse SA looked like on my custom painted board.","link":"/CM-Storm-Quickfire-Rapid-on-SA-PuLse/"},{"title":"CM Storm Quickfire Stealth with SA Nantucket Selectric","text":"After running the SA Nantucket Selectric on my mx blacks it was time to test them out on my QF Stealth MX Greens. I swapped out all the keys and again had to choose how to setup the add-ons I wanted. Just like with the mx blacks, the SA profile made my QFS mx greens softer to type on. The only one gripe I have right now is the sound of the space bar. Since the SA profile is higher the spacebar is more domier (if ever there is a word) and this causes a pinging/doming sound whenever I hit on it. I can’t complain since the spacebar sound adds character to the key pressed and I am not annoyed by it. I know some people will get annoyed by it and complain but I don’t care I like the sound of it. I tested 10fastfingers with this Nantuckets and I improved to by 4-6 words per minute on both my mx blacks and mx greens. I am really starting to think of giving up my GMK cherry profile sets for SA profiles since they really feel nice for typing. I am just concerned about the pricing for the SA profiles going up.","link":"/CM-Storm-Quickfire-Stealth-with-SA-Nantucket-Selectric/"},{"title":"Cooler Master Quickfire Stealth Cherry MX Green","text":"I was able to get myself the Cherry MX Green switches.. It is very hard to find around my area and to get one at a bargain price is really something uncommon. Definitely the sound louder than the blues. My expectations about the resistance of the switches was correct it’s a tad bit harder than the blues but not really as stiff as the blacks. I just feels alright. I was able to test drive the board at work the whole day today and it feels great. I had to move my side printed pbt’s to it and it looks just as nice. Stoked!!! Full Album below Cooler Master Quickfire Stealth Cherry MX Green","link":"/Cooler-Master-Quickfire-Stealth-Cherry-MX-Green/"},{"title":"Cooler Master Masterkeys Pro PuLse","text":"1 day after my CM Masterkeys Pro S got delivered I decided to install my PuLse SA keycaps on them. I don’t normally use the stock/oem keycaps that come with my keebs, I just try them out for a day or two after receiving the keyboard and put nice keysets on the board after that. I think the set looks good on the keyboard. Only issue I have with the keyboard is the stabilizers, they SUCK!","link":"/Cooler-Master-Masterkeys-Pro-PuLse/"},{"title":"CM Storm Quickfire Rapid with Unbranded PBT Keycaps","text":"","link":"/Cooler-Master-Storm-Quickfire-Rapid-with-Unbranded-PBT-Keycaps/"},{"title":"Current Desktop... Desktop","text":"So I reformatted my main desktop yesterday and it is set to run exclusively on linux. I felt like the only thing that was stopping me from removing windows was Dota 2, which actually runs fine in Linux. I checked programs I was running on the desktop with windows and most if not all of them have open source equivalents. So I spent sometime configuring my desktop and came up with this. I still need to work on my creativity.","link":"/Current-Desktop-Desktop/"},{"title":"Custom Blue CM Storm Quickfire Rapid","text":"Finished product after repainting my Quickfire Rapid with Cherry MX Black","link":"/Custom-Blue-CM-Storm-Quickfire-Rapid/"},{"title":"DSA Granite","text":"In between May and July I decide to sell my DSA key caps since I found out that DSA is not really for me. I like the design no doubt about it but I really like/love higher profile key caps. Too bad I really wanted to keep and use the DSA Granite Elven Tongue caps but unfortunately the profile is not for me. I eventually sold them to someone in the Philippines and he decided he wanted all the kits.","link":"/DSA-Granite/"},{"title":"Dead Liquid Cooling","text":"So I woke up today and turned on my desktop… 2x120mm AIO fans unusually running at full speed. I check speed and fan and my processor was burning. So I turned off my desktop and quickly checked inside bios and found out that the pump was not reporting any activity. I switched the pump fan header to a different fan header on my system board and turned on the machine. Result = SAME My tower before the pump died So I took out the OEM Intel fan that I had and quickly installed it hoping I would get the same result (hoping that the AIO pump was not dead) but viola the system temps were back to normal. So as it stand my Deepcool gamerstorm 240MM AIO pump is dead. The fans run but the stupid pump is dead. Oh well the system is now back up to normal using the original OEM Intel fan. I am thinking of keeping it this way for a bit since I am due for a system upgrade soon and I only usually do light gaming on the desktop anyways (Dota 2) and thats about it. I mostly use it for torrents and watching movies on my TV. Damn deepcool it’s so sad to see it die but you can’t have it all. I’m going to include it on the desktop set that I am selling (Intel E7400, 4gb corsair ram, Asus P5Q SE Plus, Coolermaster PSU and a broken 9800 GT) Hope someone buys it and I am going to use the money to buy WD NAS Reds. RIP Deepcool","link":"/Dead-Liquid-Cooling/"},{"title":"Debian Minimal Desktop 01","text":"Been using Linux since 1997 and I have fun using it full time for my home desktop computer. I wasn’t able to enjoy it before when I was younger because yeah computer games so I had to dual boot linux with windows. Back in the day it video card and game support for linux was zero to none. Back in the day the only way to play computer games if you are running linux was via Wine but it was not really mature enough then that it takes a lot of people time to configure and run games. Not sure now about wine since I have not used it for a long time. Things changed when nvidia started supporting the operating system by releasing their own drivers. Then came along Steam and linux native games (not that I still play a lot of games). I posted a screenshot of my current desktop on Reddit and many seem to like it and was asking how I configured my desktop to look this way. So I am also sharing here the things I used to make the desktop look how it should Wallpaper was originally from wallhaven Dock Conky Config Top Bar Conky MPD Icons I would expect you know how to configure conky so I wouldn’t be giving out instructions on how configured my. There are also a lot of tutorials online about conky. But if you really feel the need to ask me things you can do so by checking the homepage for ways to contact me. The title of this post includes the number “01” since I change my desktop from time to time which means I might be posting my other desktop configuration in the future.","link":"/Debian-Minimal-Desktop-01/"},{"title":"Delete all members of a Facebook group and delete a facebook group","text":"Facebook groups has been around for a long time. Facebook groups has been mostly used for selling things online and is a good alternative for sites like ebay and other selling/action sites basically because it is free and you mostly sell to your target market. Some people like me admin/own some facebook groups and there are instances that we want to delete a group to create a new one or simply remove the group since it is not being used anymore. Unfortunately for facebook there is no automated way of doing it within their website. To delete a facebook group, you have to first remove all the members of the group and then you will have to leave the group to complete remove that group. If you have like 50k+ members, removing them one by one is such a big task and will eat up a lot of your time. Here is an automated way to remove the members of your group. You will need to either use google chrome or mozilla firefox and leave it open while the script is running. Open the facebook group and browse the members link Scroll to the bottom of the page and click on “see more” Now open up your browser the console for your browser. For google chrome the shortcut is “ctrl + shift + j” and for firefox it is “ctrl + shift + k” paste the code below in the console and let it run and do it’s own thing 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185186187188189190191var deleteAllGroupMembers = ( function () { var deleteAllGroupMembers = {}; // the facebook ids of the users that will not be removed. // IMPORTANT: add your own facebook id here so that the script will not remove yourself! var excludedFbIds = ['jessica.manoo.7']; // make sure each id is a string! var totalDeleted = 0; var usersToDeleteQueue = []; var scriptEnabled = false; var processing = false; deleteAllGroupMembers.start = function() { scriptEnabled = true; deleteAll(); }; deleteAllGroupMembers.stop = function() { scriptEnabled = false; }; function deleteAll() { if (scriptEnabled) { queueMembersToDelete(); processQueue(); } } function queueMembersToDelete() { var adminActions = document.getElementsByClassName('adminActions'); console.log(excludedFbIds); for(var i=0; i&lt;adminActions.length; i++) { var gearWheelIconDiv = adminActions[i]; var hyperlinksInAdminDialog = gearWheelIconDiv.getElementsByTagName('button')[0]; //var fbMemberId = gearWheelIconDiv.parentNode.parentNode.id.replace('member_',''); //var fbMemberName = getTextFromElement(gearWheelIconDiv.parentNode.parentNode.getElementsByClassName('fcb')[0]); var fbMemberName = gearWheelIconDiv.parentNode.parentNode.parentNode.children[0].children[0].text; if (gearWheelIconDiv.parentNode.parentNode.parentNode.children[0].children[0].attributes[0] == null) continue; var str = gearWheelIconDiv.parentNode.parentNode.parentNode.children[0].children[0].attributes[0].value; str = str.substring(str.indexOf('.com') + 5); fbMemberId = str.substring(0,str.indexOf('?')); if (excludedFbIds.indexOf(fbMemberId) != -1) { console.log(&quot;SKIPPING &quot;+fbMemberName+' ('+fbMemberId+')'); continue; } else { console.log('Queing: ' + fbMemberName+ ', (' + fbMemberId + ')'); usersToDeleteQueue.push({'memberId': fbMemberId, 'gearWheelIconDiv': gearWheelIconDiv}); } } } function processQueue() { if (!scriptEnabled) { return; } if (usersToDeleteQueue.length &gt; 0) { removeNext(); setTimeout( function() { processQueue(); },1000); } else { getMore(); } } function removeNext() { if (!scriptEnabled) { return; } if (usersToDeleteQueue.length &gt; 0) { var nextElement = usersToDeleteQueue.pop(); removeMember(nextElement.memberId, nextElement.gearWheelIconDiv); } } function removeMember(memberId, gearWheelIconDiv) { if (processing) { return; } var gearWheelHref = gearWheelIconDiv.getElementsByTagName('button')[0]; gearWheelHref.click(); processing = true; setTimeout( function() { var popupRef = gearWheelHref.id; var popupDiv = getElementByAttribute('data-ownerid',popupRef); var popupLinks = popupDiv.getElementsByTagName('a'); for(var j=0; j&lt;popupLinks.length; j++) { if (popupLinks[j].getAttribute('href').indexOf('remove.php') !== -1) { // this is the remove link popupLinks[j].click(); setTimeout(function(){ var confirmButton = document.getElementsByClassName('layerConfirm uiOverlayButton selected')[0]; var errorDialog = getElementByAttribute('data-reactid','.4.0'); if (confirmButton != null) { if (canClick(confirmButton)) { confirmButton.click(); } else { console.log('This should not happen memberid: '+memberId); 5/0; console.log(gearWheelIconDiv); } } if (errorDialog != null) { console.log(&quot;Error while removing member &quot;+memberId); errorDialog.getElementsByClassName('selected layerCancel autofocus')[0].click(); } else { console.log(&quot;Now Deleting &quot;+ memberId + ', (' + totalDeleted + ')'); totalDeleted = totalDeleted + 1; } processing = false; },1500); continue; } } },1000); } function canClick(el) { return (typeof el != 'undefined') &amp;&amp; (typeof el.click != 'undefined'); } function getMore() { processing = true; more = document.getElementsByClassName(&quot;pam uiBoxLightblue uiMorePagerPrimary&quot;); if (typeof more != 'undefined' &amp;&amp; canClick(more[0])) { more[0].click(); setTimeout( function() { deleteAll(); processing = false; }, 4000); } else { deleteAllGroupMembers.stop(); } } function getTextFromElement(element) { var text = element.textContent; return text; } function getElementByAttribute(attr, value, root) { root = root || document.body; if(root.hasAttribute(attr) &amp;&amp; root.getAttribute(attr) == value) { return root; } var children = root.children, element; for(var i = children.length; i--; ) { element = getElementByAttribute(attr, value, children[i]); if(element) { return element; } } return null; } return deleteAllGroupMembers; })();deleteAllGroupMembers.start(); Let me know in the comments section if this works out for you. I’ve used it just today and it seems to be working fine. Please take note that facebook updates their website from time to time and change the code, so the code above might stop working after sometime.","link":"/Delete-all-members-of-a-Facebook-group-and-delete-a-facebook-group/"},{"title":"Dota 2 7.00 Update","text":"Dota 2 has finally released its newest patch 7.00.. A lot of things has changed with this patch. The most noticeable one would be the arrival of a new character which is the monkey king. Seems fun. I think I should start counting how many trees are there in the new map. If you want to find out the newest changes to the game you watch the video below","link":"/Dota-2-7-00-Update/"},{"title":"Dota 2 Asia Championships 2018 All-Stars","text":"Dota 2 Asia Championships 2018 has announced the captains for the all-star game. Liquid.Miracle- and VGJ.T.Sylar will get to choose their own team and the showdown will happen on April 6, 2018. Hopefully people take the all-star game seriously. As far as my observation goes, it really taken for granted. I mean all-star games are the only time we can see our favorite players in one team and trying to play as 1. I know I am not the only who wants to see a serious match between all-stars. A serious match will not only be a enjoyable game to watch but also can be a learning experience for most noobs like me. Your #DAC2018 All Stars. Liquid.Miracle- and VGJ.T.Sylar will be the captains and get to choose playground style, live on stage, their respective teams for a 5v5 showdown on April 6.It should be a blast! 🎉 pic.twitter.com/KjpBP81Lbg&mdash; Perfect World_DOTA2 (@PWRD_DOTA2) March 27, 2018","link":"/Dota-2-Asia-Championships-2018-All-Stars/"},{"title":"Dota 2 Asia Championships 2018 Survival Guide","text":"Dota 2 Asia Championships 2018 will be kicking off tomorrow March 29, 2018 12pm Shanghai, China local time. This is one of the big major tournaments of the season and each team is looking forward to not only getting a share of the 1 Million Dollar prize pool but also getting a share at the available 1,500 Pro Circuit Points With the event about to go underway in less than 24 hours, below is the format of the tournament. Group Stage 16 teams compete as two groups in a best-of-one round robin format. Top two teams of each group advance to the Playoffs. Bottom two teams of each group will be eliminated. 3rd to 6th teams of each group advance to the Breakout. Main Event The Main Event consists of the Breakout and the Playoffs. During the Breakout, the 3rd to 6th teams in the Group Stage compete the remaining four slots in the Playoffs in a best-of-three single elimination format. Losers will be eliminated. During the Playoffs, eight teams compete for the championship of DAC 2018 in a double elimination format. The first two rounds of Lower Bracket are best of one, while the Grand Finals are best of five. Others are best of three.","link":"/Dota-2-Asia-Championships-2018-Guide/"},{"title":"Dota 2 Asia Championships 2018 Live","text":"Live streaming for Dota 2 Asia Championships. If you do not have access via the game or youtube this might work. Hope this helps someone.","link":"/Dota-2-Asia-Championships-2018-Live/"},{"title":"Dota 2 Balance Updates Every 2 Weeks","text":"To make it easier to keep track of changes, we'll also be releasing a new in-game feature to notify you of any recent changes to heroes in your match.&mdash; IceFrog (@IceFrog) February 1, 2018 Icefrog has just announce that they will be releasing updates for Dota 2 every two weeks, small balance updates that is. He also said that there will be a new system to inform players of these changes in game. How will these changes affect the games specially the tournaments leading up to TI is everyone’s best guess. Tell me what you think in the comments section below.","link":"/Dota-2-Balance-Updates-Every-2-Weeks/"},{"title":"Dota 2: Execration will miss Boston Majors FUCK ME","text":"I just read about it not sure when the news came out but fuck this shit.. Stupid fuck…. GOD DAMN IT!!! Read all about it here: FUCK EXECRATION WILL MISS BOSTON MAJOR BECAUSE OF THE STUPID VISA GOD DAMN MOTHER FUCKER!!!","link":"/Dota-2-Execration-will-miss-Boston-Majors-FUCK-ME/"},{"title":"Dota 2 The International 2018 Main Stage","text":"The group stage dust has settled. Dota 2’s The International 2018 main even will start. 2 Teams, Invictus Gaming (China) and Pain Gaming (South America) has been eliminated from the tournament. Thank you to @wykrhm for the image of the main stage brackets below. It will be a win or go home game for bottom bracket teams to start of the main stage since it will be a best of 1.","link":"/Dota-2-The-International-2018-Main-Stage/"},{"title":"Dota 2: True Sight Episode 2 Fnatic &#x2F; EG","text":"Dota 2 has really gone too mainstream… Too mainstream in fact they seem to have their own TV show. This if behind the scenes for EG and Fnatic. 2 teams that went completely 2 different paths.. EG qualified and Fnatic never made it.. Fnatic never really made it anywhere ever since midone, 343, dj left the team. Not sure what the deal was but they were able to snag 3 members of TNC. Yes the 3 members of the team that eliminated OG during TI6. Watch the video below quite interesting.","link":"/Dota-2-True-Sight-Episode-2-Fnatic-EG/"},{"title":"Dota 2 Update 7.00 Corrupt Data Files Error","text":"I have been running Linux on all my computers at home both my desktop and my laptop. That means I am playing steam from Linux (well at least the natively supported games for linux) Recently I posted the new Dota 2 7.00 patch… a very big patch from Valve which kinda changed the game a whole lot…. that includes support for certain file systems (I guess).. I was running dual boot windows 10 and linux on my desktop before I decided to delete the windows partition since I find myself always using Linux instead and I am not as young as before in a sense that I do not play a lot of computer games anymore.. I do have my playstation 4 for the casual NBA 2k gaming though. So I had a data drive where my steam directory is stored since I am running my OS on a SSD drive and it doesn’t really have too much space. This drive is an NTFS partition drive since I was using it with windows previous and never bothered to change it since I am able to read/write on the drive without any issues. Another reason I did not change is because, since it is my data drive I can always remove it and connect it to another machine (most probably running windows) and it will be recognized by that machine without any issues. Going back to the problem…. the update will not finish and will always give me an error about “Corrupt Data Files” I tried several fixes including removing the whole game itself and tried reinstalling it but was still having the same error. What I did was I removed the game and reinstall it but this time I chose to install it on my Linux OS drive which is using ext4 file system. It installed just fine and ran without any issues. Now I am not sure if this is a limitation put in by Valve or they made a mistake since running the game from a NTFS partition worked just fine before. Until I read any updates on this I will be running Dota 2 from my main Linux drive. If you are reading this you might be having the same issue. I sure hope this fixes the problem you are having.","link":"/Dota-2-Update-7-00-Corrupt-Data-Files-Error/"},{"title":"Dota 2 Update 7.00 New Aghanims","text":"Please video below for the all new Aghanims. Damn it… OMG!!! WTF!!!","link":"/Dota-2-Update-7-00-New-Aghanims/"},{"title":"Dota Asia Championships 2018 Cast Complete","text":"After the dust has settled, Dota Asia Championships 2018 cast is now complete. 16 teams will try to win not only the money but also the important Dota Pro Circuit points for The International. Directly Invited Teams Regional Qualifier Winners","link":"/Dota-Asia-Championships-2019-Cast-Complete/"},{"title":"Doubleshot PBT in Carbon Colors","text":"Yep you heard the title right. It seems like China is upping their keycap game with this new achievement. For the most part of my mechanical keyboard life, many have asked and have wondered if it was possible to produce doubleshot PBT keycaps. 1 for one like the feel of PBT dyesubbed keycaps because of its thickness and also I like how it feels when I put my fingers on it. Many (including signature plastics) have said that it was very hard to produce doubleshot PBT keycaps resulting to multiple dye subbed keycap sets. A chinese manufacturer may prove them wrong this time with these set. I believe it is the first one in cherry profile too. Price is also much more affordable compared to GMK or SP doubleshot abs keycaps. What happens next remains to be seen. Kprepublic the online seller from aliexpress has stated that this is not the first colorway that they intend to produce. Hopefully they produce support for other layouts like 75%, 1800 and ergodox. I still believe once they produce keycaps for the unusual layouts their customer base will grow exponentially.","link":"/Doubleshot-PBT-in-Carbon-Colors/"},{"title":"Execration Get&#39;s Direct Invite to Dota 2 Boston Major","text":"Dota 2’s 1st major tournament is in about 6 weeks and they have announced the team that are directly invited without going through the qualifying stage… Surprise surprise… Execration from the Philippines gets the 6th invite. Not too shabby. And for the first time an all-Filipino team gets directly invited. Hometown heroes from the Philippines, Execration is the first all-Filipino team to be directly invited to a Major, earning their spot thanks to a phenomenal championship run on the MPGL and amazing plays on Puck from Kim “Gabbi” Villafuerte and consistent support play from ex-Fnatic member Djardel “DJ” Mampusti. I will be closely following the road up the tournament.. Hopefully more teams from southeast Asia can qualify","link":"/Execration-Get-s-Direct-Invite-to-Dota-2-Boston-Major/"},{"title":"Ferrai 458 Inside a Toyota 86 Body","text":"Guys from Donut Media must be out of their mind. Fuck Meh damn it.. God damn.. I hope to see this car running soon. They just posted a video of the engine on and revving More about this build from the facebook page below Donut Media Facebook Page","link":"/Ferrai-458-Inside-a-Toyota-86-Body/"},{"title":"Flat File CMS","text":"Flat file webpages are fast. Been into this open source cms things for sometime now (like since the first wordpress version came out) and all of my time with this has been spent with CMS + database which is not too bad if you have nice hosting and you don’t get too much traffic. Some of the issue I have encountered with dynamic database driven cms are you need a fast server &amp; web host if you will run a lot of plugins the more users, the more database calls hence slowing site performance if you are not on a fast server needing fast server/web host means needing to pay more Above are just few things I can think of. Don’t get me wrong but I am for dynamic websites that is if you need one. I have ran an SMF Forum site for years before and I know the pains when you have large number of users specially forum websites. I had to move from shared hosting to reseller hosing to VPS and finally to a dedicated unmanaged server within 1 year because the website growth went fast. Recently I got into static webpage generators such as Jekyll but it was too technical for me. I am not that technical when it comes to back-end coding and shit hahaha. A few months back I remember reading about this flat file cms (i.e. grav, kirby, pico, automad, nibbleblog etc). So a few days ago I went on to Mr. Google and searched for flat file cms. I read about bludit from a reddit link I found and tried it out. So far so good for this CMS at least for this personal site that I am running. Plugin availability is enough for me atleast for what I need but I’d like to see more of the things I got used to wordpress but I ain’t complaining bitches So for the first few runs at bludit, it seems all good for now.","link":"/Flat-File-CMS/"},{"title":"Fnatic Rear Ends Secret","text":"OML LULZ WTF!!! Literally ESL One Katowice started a few days ago. After 3 days a lot of teams have dropped with the likes of Navi, OG, Mineski and a few more. One of the most, if not the most unexpected game end happened yesterday between Fnatic and Team Secret. Both teams battled each other and went the distance to 3 games. Game 1 was taken by Fnatic and the 2nd game was taken by Team Secret. Game 3 was no different and was really very close. I won’t really go into details since you can always watch the replay somewhere but I would say at around the 50 minute mark, most people including me have concluded that it is a won game for Team Secret specially when EternalEnvy died and Fnatic lost their mid barracks. While all the fighting was happening just outside Fnatic’s base the creeps were actually doing massive damage on Secret’s own base. The fighting went all the up to the top barracks and eventually EE and PieLieDie died without buyback. This was when the shit got real, Universe used his Dark Rift to teleport him, Abed and DJ to the radiants ancient which was half life because the creeps were already constantly hitting it. Secret wasn’t able to teleport back to base and glyph was down. Only Midone was able to go back but he really can’t do anything to stop it. It was really a finish for the books. Fnatic just rear ended Secret (a come from behind win if you know what I mean) to come out on top securing them to the semifinals and more importantly a secured top 4 finish. Here is the video of the ending of the gameHOLY SHIT!!!THAT DID NOT JUST HAPPEN!!@FNATIC manage to Dark Rift themselves to a stunning 2-1 victory over @teamsecret! A simply incredible ending to an amazing series! #ESLOne pic.twitter.com/IQUHRSwjz4&mdash; ESL Dota2 (@ESLDota2) February 22, 2018 Casters and Commentators Went Nuts","link":"/Fnatic-Rear-Ends-Secret/"},{"title":"Fuhlen Mechanical Keyboard...RGB + Cheap &#x3D; Win","text":"At the beginning of this month I was shopping around for replacement keycaps for my CM Store Quickfire Rapid . I really wanted to try a different kind of mechanical keyboard switch and at the same time have some RGB colors on it. With the lack of funds at the moment I opted for a cheap Chinese brand keyboard. There are a lot of mechanical keyboards on sale in TaoBao. You can even see the brands being sold from Massdrop. I normally use TKL keyboards and there not much to choose from in this category atleast during the time when I was buying mine. What I did was get the brand and tried to find a review of some sort on youtube You will be surprised how many people use cheap mechanical keyboards nowadays. Probably one of the reason is because Cherry lost their patent on their mechanical switches and that means party time for Chinese copycats. As of this writing I believe there are a few mechanical switches available from China: Kailh, Gateron, Otemu are among the famous one’s. I did find a lot and at the end I settled for this Fühlen SM680R TKL Full RGB keyboard. It comes with Kailh Blue switches which from what I gather are copies of Cherry MX blues. It is full RGB with 9 RGB modes (oh yes). The package is shown below when opened. It only comes with a red keycap remover and a manual which is in Chinese so I have no use for it. It’s almost as heavy as my non rgb CM storm. The button feels good and are very clicky clacky clack clack. The keycaps as expected is no up to par with most of the known brands but for the price I cannot really complain. I just feel that it is somewhat soft when pressed, maybe because I got used to my Cherry MX black switches. Typing on this keyboard is really a nice experience the clicks are pronounced. It is a whole new experience for me coming from black cherry mx switches. I now understand why people like blue switches. The usb cable is not detachable which is ok but it is braded with one end of the velco cable unremovable. Which is nice if you like to keep your cables organized and you don’t have to worry about losing it The only gripe I have with this keyboard is legends not sure what they wanted to achieve from it but it does not look like its more for gaming but then again like I said previously I can’t really complain because of the price. The mode I use the most is the mode where you set the specific color you want to use for each key. It is quick nice if you play in the dark. I do not really use the moving lights modes as I am afraid it might cause the LED’s life to deteriorate. All in all I am happy with the purchase. I was supposed to use my CM Storm Quickfire for office and keep the Fuhlen keyboard for home use. I ended up doing it the other way around since it was much more nicer to type on blue switches plus I can show off at the office and annoy people with the clicky clack clack clack click sound. I do not know how long the keyboard will last before something breaks but definitely I will have it posted here when it breaks down. The local seller did give me lifetime warranty on the switches so that is all good. Album with all the keyboard photos below Fuhlen SM680R RGB Mechanical Keyboard","link":"/Fuhlen-Mechanical-Keyboard-RGB-Cheap-Win/"},{"title":"GMK Carbons Keycaps","text":"My GMK Carbon Keyset has arrived. Thanks to the guy I bought it from and I am surprised shipping was on point on this one considering we used regular post from USPS to Poslaju Malaysia and they delivered on a Saturday!! That is something new. Hope you like the photos below. Hi resolution photos should be in my imgur album GMK Carbon","link":"/GMK-Carbons-Keycaps/"},{"title":"Ganss GK87 Pro + SA Carbon","text":"The Ganss GK87 Pro is one of those keyboards you can buy that comes with good RGB underglow. When I say RGB, I mean RGB. RGB whores will definitely be in love with the glow of this thing. The underglow also comes with several lighting modes which is quite nice. The board feels solid and really feels premium. If there is one complaint I have with this board, it would be the non detachable usb cable. I like my usb cables detachable since I normally bring my keyboards to work or some place where I need to do some typing stuff. The feel of the keyboard is very good for it’s price. IMHO the stabilizers on this thing is far better compared to let’s say my CM Masterkeys Pro S. I have a video about the sound of the stabilizers in my youtube channel if you would like to check the sound.","link":"/Ganss-GK87-Pro-SA-Carbon/"},{"title":"HHKB Type S","text":"Not much… just wanted to share some photos of my HHKB Type-S before I sold it. Not much people know that I have this board, well I wasn’t really too fond of it. I did not really like to use it not sure maybe because I don’t like the layout or because I don’t like the feel or the sound of it. Basically all stock when I sold it and came with 2 pbt spacebars from the devil Massdrop","link":"/HHKB-Type-S/"},{"title":"I am fucking late for the party then.. Onyx.Abed","text":"I am freaking late for the fucking party… Just found out Abed left Execration… only to find out after 15mins that he joined a new team named Onyx and all this happened last month.. Dafuq just happened. I did try to catch Execration during the ESL One Genting but was not really able to watch games because of my professional career (WTF?). Execration did not really show up in that tournament and now I think know why they never showed up… there was no Abed. Oh well good luck to Abed who is not part of a US (NA) Based team… I think he is the first one aside from Jeyo Madayag of Rave years back. Hope he can carry the Philippine flag higher. Looking at the bright side for things, this could potentially open the doors for more professional Filipino players who has potential to get picked up by foreign teams. Seems like this is the debut of Abed Meepo with his new team.","link":"/I-am-fucking-late-for-the-party-then-Onyx-Abed/"},{"title":"Ignition Model 1:18 LB-Works Hakosuka 2Door Red","text":"If it’s not yet obvious, I like old school cars and I like them low. Well atleast that is how I like them with toys or scale models since I do not have the means to buy one (atleast for now) beside this one is fairly hard to find nowadays. Here is another example of how I want a hakosuka to look like if ever I had one. I really like the details on this model, rollbars, wheels, external oil cooler and the color. Only drawback with with this model is it is resin made so the doors, hood, trunk do not open which I think is a let down for the price. Would really have looked good if those options were there.","link":"/Ignition-Model-1-18-LB-Works-Hakosuka-2Door-Red/"},{"title":"JTK Debut PoW (Purple on White)","text":"JTK Debut or sometimes called PoW which is short for purple on white. The first keyset produced by a company JTK. It is like GMK double shot abs. Comparing JTK with GMK, I would say GMK is more polished and the quality is more mature. Not too bad considering JTK is a new company. Not really sure if they created their own molds but if they did then they did a hell of a wonderful job. I am not really too sure about the history of the molds all I know is that GMK bought the original tooling from Cherry and ever since then they have been producing cherry profile keycaps. In any case these JTK I would say is great if you want to try out doubleshot abs and want to know how it would feel like typing on a GMK.","link":"/JTK-Debut-PoW-Purple-on-White/"},{"title":"KBD75 + DSA Dolch","text":"Here is the album for my KBD75 using DSA Dolch by signature plastics. I think the keyset colors matches the blue board but for some it might look weird. DSA Dolch was one of the DSA sets that I own unfortunately, I do not like the DSA profile because it is too low for me. I think I got used to SA profile and I prefer OEM or higher profile caps. Unfortunately I do not have any typing videos of this keyboard and I have sold the DSA Dolch set.","link":"/KBD75-DSA-Dolch/"},{"title":"KBD75 + DSA Granites","text":"My old KBD75 when it was still using DSA Granite with Elven Tongue alphas. The keyboard was purchased from kbdfans. I have a post about it before and a few sound test videos on different keycap sets. The Elven Tongue was really nice and quite hard to find since Signature Plastics isn’t manufacturing them anymore.","link":"/KBD75-DSA-Granites/"},{"title":"KBD75 + JTK PoW (Purple on White) Debut","text":"I’ve had this JTK Purple on white for quite sometime now and only last week I have decided to slap in on my KBD75. Since I sold most of my keyboards and I only have the KBD75 to play with, I guess it was time to run the set with the custom keyboard that I have. It looks ok to me but some people might find the color combination odd or colors might not match. If you check my website or even my youtube channel you will find the sound of this keyset and the DSA’s almost sound the same. Considering these are doubleshot ABS and waaaay more thicker than the DSA’s, I thought that they should have sounded quieter. But anyway I hope you enjoy the album below.","link":"/KBD75-JTK-PoW-Purple-on-White-Debut/"},{"title":"KBD75 Lubed Stabilizers","text":"As with my previous post.. I was complaining about the rattly stabilizers.. So I decided to do something about it and lubed the fuck out of the cherry stabilizer copies that came with my kit. The results may not be perfect but it is definitely much better than the un-lubed stabs. See the video and let me know if you have questions or suggestions","link":"/KBD75-Lubed-Stabilizers/"},{"title":"KBD75 - My First Custom","text":"Just got back to fixing the website after a lot of things happened in real life. Something happened with the previous database and I was not able to retrieve all of the posts so technically this is a repost. Back in May I was able to acquire a kbd75 kit from kbdfans the first to offer affordable customs to mechanical keyboard enthusiasts like me. The album above shows the built product after soldering all the switches. My first official custom keyboard. This is made in China and I can say the build quality is up to par for what I paid for. I have been wanting my own 75% keyboard for a while now. I feel like this layout is the best of the following: full layout, TKL and 60% since the size is not as small as the my previous poker but not as big as my previous TKL’s and I have the necessary modifier cluster for the common keys I use like del, home, page up and page down. What’s good: Weight. This thing can be used to kill someone Undergrow. Backlit (althought I did not opt to install leds since keycaps I use is not for backlit) Easy to program using bootmapper client Macro functionality which is very useful for my job Aluminum with custom annodized color What’s bad: Underglow is not as bright as you might expect. It is subtle and can’t really be used to show off The chinese copy cherry stabilizers that came wth my kit is trash. I would highly advised to lube the fuck out of the stabilizers before you intall the full kit. (I will post a video on this later)","link":"/KBD75-My-First-Custom/"},{"title":"Keycool 87 + 1976 SA","text":"Old school colors were also my kind of thing from time to time. Not sure why but in the niche mechanical keyboard world most old school color themes use a/the year for a name.. You got this 1976, 1965, 1983. I wouldn’t be surprised if they come up with a black and white theme and name it 1911 or 1912.","link":"/Keycool-87-1976-SA/"},{"title":"Keycool 87 Cherry MX Reds + Carbon SA","text":"Recently decided to take out the keycool out of storage room retirement. It has cherry mx reds and this board always reminds me how I wanted my keyboard to sound when I was just starting. Too bad the switch is too soft for me and it does not help that it is linear and feels dull when I am typing. Not sure if the photos in the album above show justice for how this combination looks. Most of the time, people how have SA Carbon use the keycaps with a dark colored board and I have not seen anyone use the keycap set on a light colored board.","link":"/Keycool-87-Cherry-MX-Reds-Carbon-SA/"},{"title":"Keycool 87 + Danger Zone SA","text":"I’ve decided to use my Danger Zone SA with the keycool and I like how it sounds when combined with the keyboard. Ofcourse there will be sound difference depending on the keyboard and keycap combination. I have posted a typing sound test video for this combination here","link":"/Keycool-87-Danger-Zone-SA/"},{"title":"Keycool 87 + Solarized SA (Penumbra)","text":"One of the most talked about sets in the mechanical keyboard scene.. It also has IMHO the most drama. Years after the initial group buy, some people are still waiting for their sets. I got this set off r/mechmarket from someone who asked Signature Plastics to produce 10-15 sets. The seller was able to persuade SP to produce a small production run because he/she informed them that it will be used internally within their company and that the sets will never come out… which as we all know didn’t happen because I have a set in my possession so does 9 other more people. In any case the colors were not for me and I only used it for a good week and decided to sell the set to someone who will actually use it. I do have typing sound videos of this keycap set on a keycool 87 keyboard.","link":"/Keycool-87-Solarized-SA-Penumbra/"},{"title":"Le Mans Cars On The Streets of Japan","text":"I found this video a long time ago and chanced upon it last night while checking out youtube. How I wish I was that rich to be able to drive a real le mans car on the streets. I know it wouldn’t make sense to every average person but being a car guy, things like this can be considered as orgasm for us. Credits to the video poster and it plays in 4k too damn!I found this video a long time ago and chanced upon it last night while checking out youtube. How I wish I was that rich to be able to drive a real le mans car on the streets. I know it wouldn’t make sense to every average person but being a car guy, things like this can be considered as orgasm for us. Credits to the video poster and it plays in 4k too damn!","link":"/Le-Mans-Cars-On-The-Streets-of-Japan/"},{"title":"Leopold FC660M PD + MT3 Godspeed","text":"I have recently acquired MT3 Godspeed. Been out of the keyboard game since late 2018 and been doing other things. I think I just got bored with the stock FC660M which I have been using since Jan 2019 and wanted it to look different. I’ve always wanted to try MT3 since /dev/tty came out but just didn’t have the money and the urge to buy it. This time around a MT3 Godspeed set came out in the 2nd hand market locally. I bought it ofcourse like other mechanical keyboard things a bit expensive or much expensive than the group buy. One good thing about this keycap set is it had support for the unusually sized right shift key for the FC660M, which is 2.25u or the same size as the left shift key (normal keyboards have 2.75u right shift key) I think it looks very very nice on this keyboard because it matches the color of the case. All in all I am happy how it turned out. The keycap set still has issue but that would be on another separte post about the keycaps","link":"/Leopold-FC660M-PD-MT3-Godspeed/"},{"title":"66key Mini Leopold FC660M PD","text":"Keyboard Features 66-Key modified US ANSI Layout w/English Legends Cherry MX series keyswitches with clicky tactile feel and silver/gold contacts; aka “Cherry Blue Switches”, 4.0mm travel, 50cN weighting (~50grams) 50 million actuations Dimensions: 325 x 109 x 39mm Detachable USB mini-B interface, 2.0m cable included NEW “Step-sculpture 2” low profile Keycaps (Leopold exclusive) High durability PBT (polybutylene terephthalate) keycaps Lasered legends Keyboard mode selection dip-switch Weight: 700g Made in Korea Whats in the box? 66-Key Mini Keyboard 2.0m USB A to mini-B cable w/velcro wrap Extra keycaps to interchange capslock with control So I sold my TX-CP a couple of weeks right before the new year. Just like my other keyboards, I felt bored with the TX-CP and felt like I needed a smaller board since I only use my mechanical keyboards at home nowadays. When I was shopping for a 65-66key keyboard, I had 3 choices: Leopold FC660M, Varmilo VA68 and Vortex keyboard. Do take note that all the 3 keyboard had the same cost at the time of my purchase. The vortex keyboard build was really not up to par for the price they wanted for it and typing on the board it sounded hollow. The VA68 was my initial choice for 65-66 keys but the store only had the special edition miya pro, mac, and the panda version which was really a Varmilo but being marketed as Ducky. In all honesty, if they had a VA68M in there I would have grabbed it, paid and be happy with it. I chose the Leopold FC660m because of the build quality and ofcourse it came with doubleshot pbt keycaps. I also have an option to get a full aluminum case from aliexpress in the future. This is an ultra compact layout that allows much of the functionality of a full size keyboard through the use of the Function layer (FN). As always I went with MX Browns which are basically my favorite switches.","link":"/Leopold-FC660M-PD/"},{"title":"Linux Mint 18 Dell Inspiron 5521 Fan Issue Fix","text":"Last month I decided to upgrade my Dell laptop to Linux Mint 18 (Sarah) from Linux Mint 17.3. I have been using linux mint as a daily driver for that laptop and so far I have no issues with it until after upgrading to linux mint 18. The fans on my laptop kept running at full speed even if its idle. A quick google search and I found out that I am not the only one having the issue. It does seem like it is a common issue with Dell laptops not just the model that I own and it is not specific with linux mint as well. I did try to configure a lot of things including changing settings in acpi to linux but that did not seem to help. I found out about i8kutils during the process but after installing it, the fans just stopped working for a few seconds then went back to it’s merry own way of running at full speed. Installing lm-sensors (sudo apt-get install lm-sensors) did not show that it detected any fans on my system (an update to this after a kernel upgrade provided by linux mint, running lm-sensors now show that it detects a fan and shows the fan speed) even though you can hear the fan physicall running. Please watch the video below on how I fixed the issue for my machine. It might or might not work for you but it is worth a try anyway. This might also work for other Dell laptops not just the model that I have. If it does work for you please leave a comment here or on my youtube video and please state the dell laptop model you used it on to help other people. My config file below (i8kmon.conf) 12345678910111213141516171819202122232425# Run as daemon, override with --daemon optionset config(daemon) 0# Automatic fan control, override with --auto optionset config(auto) 1# Report status on stdout, override with --verbose optionset config(verbose) 1# Status check timeout (seconds), override with --timeout optionset config(timeout) 20# Temperature thresholds: {fan_speeds low_ac high_ac low_batt high_batt}set config(0) {{-1 0} -1 40 -1 40}set config(1) {{-1 1} 30 60 30 60}set config(2) {{-1 2} 59 100 59 100}# For computer with 2 fans, use a variant of this instead:# Temperature thresholds: {fan_speeds low_ac high_ac low_batt high_batt}# set config(0) {{-1 0} -1 52 -1 65}# set config(1) {{-1 1} 41 66 55 75}# set config(2) {{-1 1} 55 80 65 85}# set config(3) {{-1 2} 70 128 75 128}# end of file","link":"/Linux-Mint-18-Dell-Inspiron-5521-Fan-Issue-Fix/"},{"title":"MT3 Godspeed","text":"Recently I got board with my Leopold FC660M and wanted to give it a makeover. I searched around locally if anyone was selling any interesting keycaps. I did find a few gmk’s, SA’s but what caught my eye was this MT3 Godspeed set. I have always wanted to try the MT3 profile ever since the first MT3 Set came out which was the /dev/tty but unfortunately I didn’t have the urge that time because I was kinda retired from the keyboard game. The profile is a bit lower than SA but is still very high compared to oem or cherry profile. I must say it only took me a few minutes to get used to the profile since I was used to using SA profile keycaps. It was a pleasure using the keycaps for typing but I wouldn’t say the same when using it for gaming. It will take a little getting used to. I did mount the spacebar the other way around as I am used to have my spacebar mounted that way even if I am using cherry or oem profile. The colors are nice and it compliments the color of the case. I wouldn’t say it is perfect, in fact it still has flaws specially with the legends. The legends are somewhat inconsistent and off centered. Another concern I have is that the stems are a bit too tight when installing the keycaps. Aside from that I love this keycap set and I might be using it for a bit of time. Photos below. I basically have: Solar Alphas, Apollo Mods and Spilt Spacebars","link":"/MT3-Godspeed/"},{"title":"Mazda Roadster Restoration Program","text":"Mazda has announced a restoration program for one of their famous classic the Mazda Miata MX-5 Roadster. The MX-5 like some classic cars has a huge cult following. Back in the day when the car came out, it was unique a 2 door small NA roadster. During the time when all the other manufacturers were concentrating their resources in producing cost effective sedans, Mazda chose to come up with a unique, 2 door roadster and I knew then when it first came out that it will be a classic in the years to come. True enough 28 years after it’s initial launch, the cult for this car is very much alive and kicking not only in Japan but also around the globe. So for Mazda to recognize this and provide something that I am sure every single MX-5 owner would like to be part of is something special. The announcement about the restoration was made today. There are also a trial restoration photos provided from this link Hopefully everyone who owns and loves their MX-5 can partake in this restoration program so the legacy can live on for another 28 years or more.","link":"/Mazda-Roadster-Restoration-Program/"},{"title":"Mechanical Black Clacker... Fingerasm 1","text":"CM Storm Quickfire Rapid (none-backlit) Cherry MX Black switches Photo above shows my daily warrior for work and home use. It has gone throught a lot but still working as good as the first time I bought it. The keyboard is probably almost 3 years odl already and the body of the thing is showing up the scars from the daily abuse. Normally what I would do is sell the thing off and get a new one. I can’t let this go for some reason. Lately I have been shopping for a cheap rgb keyboard and I bought one cheap chinese brand from a local seller from where I am. Quality seems ok. I will some details about it in a bit. View post on imgur.com During the process of looking for a new keyboard, I found some affordable keycaps (let’s face it geekhack.com, deskthority.net and even Massdrop keycaps ain’t really the cheapest ones you can find). I found a few tidbits in TaoBao and has asked a middleman service to order them for me. Hopefully I can get them in the next couple fo weeks. I am not sure if I ordered caps for none-backlit keyboard (this CM Storm TKL) only or if its for backlit keyboards I ain’t chinese. It was advertised as PBT which should be somewhat a bit better than regular ABS keycaps that come with most keyboards being sold in the market. I ordered couple of color sets and a RGB set for my modifiers. View post on imgur.com I plan to give new life to my old CM Storm once the keycaps arrive. I am still deciding if I will sticker bomb the cover or paint it all out completely with a certain shade of color. I might do the latter. I still need to figure out how to open this thing up though since it is still a virgin and I have not tried opening it up yet. This will give me time to completely clean up the whole thing from the inside and hopefully if I can learn how to do it is to lube the switches (Cherry MX blacks ain’t really the softest of the switches) Now I am really excited on getting those keycaps. Hopefully they arrive soon.","link":"/Mechanical-Black-Clacker-Fingerasm-1/"},{"title":"Mechanical Keyboard Keycaps Galore","text":"So this morning while at work I got a call from the courier company that they were at my house front door. I told them no was home and everyone was at work. I asked the guy if he can comeback tomorrow and he said “tah boleh” which is the local term for cannot. I was also pretty hard to communicate with him (I think the feeling is mutual). Eventually he started saying the word “gate” which I guessed he meant was leaving the package inside the gate by throwing it inside. Since I have no other choice as I am bound to work for the next 5 days for 12 hours each day including weekends, I told him yes please throw it inside and I proceeded to give him my ID. If something broke or something was missing i’de be in deepshit. The mess when I was unpacking and getting ready to try on the keycaps So enough of the story. With my previous posts I have mentioned that I ordered quite a number of keycaps from Taobao. I wasn’t really expecting too much since the price was way below compared to branded and known companies but the price was still way above my budget but you know how it is. I got 3 sets of TKL and 1 set RGB. This is how the packaging looks like and what was inside View post on imgur.com View post on imgur.com So let me go through each one of them. First off the one advertised as PBT and was the most expensive of the set. Looking at how it look like when I took if off the white box, it seems like the common keycaps you see on youtube being reviewed by people and got them off taobao as well. Of all the keycaps I ordered I like this the most for my CM Storm Quickfire Rapid. One because it was really PBT see photo comparison below. Two it was for non backlit keyboard and I did like the color scheme it came with. View post on imgur.com Check the cap comparison below. The black caps is the OEM keycaps that came with my CM Storm Quickfire Rapid and the one below is the one I ordered View post on imgur.com Next set would be the unprinted RGB keycaps for shit, alt, ctrl, windows and fn keys. It included the esc key which was printed. It was advertised as PBT and unfortunately I was not able to take a photo but it was more thicker than my oem and almost close to the first set I showed. View post on imgur.com View post on imgur.com Off to the backlits View post on imgur.com 3rd set I got was this backlit White/Gray/Red combination. This one I am quite disappointed because the keycaps was just really ABS but was advertised as PBT and was almost close to how thick my oem CM Storm keycaps were. On the good side it came with extra keys, 2 keycap pullers, 3 escape keys. The legends on this one is also much better than the other backlit keyboard that I got, well considering the price it was more expensive than the other one. View post on imgur.com This is the complete set TKL keys with the extras View post on imgur.com A more closer look at the extras View post on imgur.com 4th and last set is this orange,grey,white set. Just like the first backlit set I posted the quality is the same with the oem caps like abs and quite thin. This set also does not come with any extras just the key puller. The legends was also not that good in my opinion (it might be good for others). View post on imgur.com All in all I am happy with what I got for the price I paid. I believe the cost of all the keycaps is not even enough for 1 geekhack, SA, WASD keycap set. If you need the link for the original PBT keycaps please leave a comment with your email and I will provide you the link.","link":"/Mechanical-Keyboard-Keycaps-Galore/"},{"title":"Minimalist Linux Desktop","text":"Got bored this afternoon so I decided to change the desktop yet again. You see I think this is one problem most Linux users run in to. Because of so much things you can do with the operating system and the amount of control that you have over it, people tend not to stay into one setting or one app. Everything keeps changing, keeps getting updated, new stuff comes out all the time. Anyway I stumbled upon a few bits and pieces and combined them and came up with this","link":"/Minimalist-Linux-Desktop/"},{"title":"Modern Biege Purple Hangul","text":"Being in the keyboard game means not only talking/dealing about different keycaps and profiles. It also means dealing with different type of plastics used with keycap manufacturing. Aside from ABS which is the common plastics used with your keyboard or stock keyboard keycaps. There is also PBT which has a different texture and also has different qualities compared to ABS plastic. Common reasons people want to use pbt is because they do not shine as fast as normal ABS plastic, they are not as susceptible to fingerprints or dirt accumulation compared to ABS. If you want to know a lot more about PBT plastic Wikipedia has nice information about it. This modern beige set that I have came from Originative it is basically like Gateron think pbt or maybe enjoypbt. 1.5mm thick and the feel to it is quite nice. PBT is nice to type on from time to time but if you follow this website you would know that I am more on thick abs specially the Signature Plastics SA profile keycaps. Nonetheless think PBT like these are nice for someone who likes cherry profile keycaps.","link":"/Modern-Biege-Purple-Hangul/"},{"title":"Merc for Dota 2 Katowice MVP","text":"The #MBmvp is back!Announcing the @MercedesBenz MVP award for #ESLOne Katowice.Who will be the owner of a brand new Mercedes-Benz?https://t.co/PGMMAvQDZb pic.twitter.com/UTkInus4x2&mdash; ESL Dota2 (@ESLDota2) February 19, 2018 Well shit just got real… Who would have thought of something like this, I know I didn’t. And parents keep telling their kids that there is no future in computer gaming. ESL has just announced that the MVP for the upcomming ESL Katowice Dota 2 tournament will take home a new Merc. I didn’t see that coming when ESL announced their partnership with ESL in 2017 In ESL One Hamburg, Mercedez provided each team attending the tournament with a custom branded Mercedez car. Apparently Merc was not happy with this and has upped their game. Only thing I do not like about this is the fact that it involves a voting system. I mean I understand that they want the community to be involved specially with something like this but I hope there are measures put in place to stop abuse. What is stopping someone from abusing the voting system right? I hope they can do something like the NBA MVP system where stats, player votes and fan votes gets involved. Regardless what happens, things like this will not only help but will improve the dota 2 scene. I wonder what Gaben has to say?","link":"/Merc-for-Dota-2-Katowice-MVP/"},{"title":"Obins Anne Pro 60 Lighting Modes","text":"I have been looking for a TKL board with Gateron or Cherry MX Red switches (used) for quite sometime now and have not had the luck. Either the board being sold is too used with out of this planet prices or the board being sold is something that I do not like. I was online the other day checking whats up for sale on a few Facebook groups I was a member of. I found one guy selling his Anne Pro 60 60% mechanical keyboard with Gateron red switches. So I did what normal people would do, look up reviews about the board online. I know about the keyboard for quite sometime now but I have never really looked it up because I was never really interested with 60% keyboards since I need the function row and the arrow keys for work. I found a lot of good reviews about the keyboard and also some good sounding switch test. It got my attention since I can program the keyboard settings via a mobile app. Programming the keys and also the colors since this is a full RGB keyboard. A bonus feature that got me was that it can be used as a wireless keyboard via bluetooth and if your computer does not have a built-in bluetooth Obin’s was nice enough to include a bluetooth usb dongle (sweet) I contact the guys and we met near his location, actually we have to get the keyboard from his house. I got the keyboard in a, you could say not so clean condition. The guy who sold it to me does not clean his stuff If you ask me. So when I got home the first order of business was to test out the keyboard functionality which would be: rgb lights, usb connection, function keys, bluetooth connection and also the app connection. Everything checked out fine. I did not bother taking photos of the keyboard with the stock keycaps since they were dirty. I took off all the caps and soaked them in a bowl with warm water (take not warm not hot) with alcohol to disinfect the key caps. I cleaned up the pcb with a paint brush and used foam and water to clean up the rest of the case. After soaking the stock keycaps in water with alcohol, I then proceed with washing them with soap (dish washing soap) and rinse them. They are no clean and happy drying in our dining table. I would say the gateron reds are really light maybe because I got used to my mx black and greens. This keyboard is very nice to type on no stress or anything and I like the sound of the keyboard when the keys bottom out. I would say for the price I paid for it used is money well spent with all the features I get. I intend to use this for office use and have configured the FN key to be on the left side since most of the special functions are on the right side of the keyboard (pg up, pg dn, del, insert, prnt scrn etc) I only took photos of the lighting mode on this keyboard hope it gives you an idea of “some” of the lighting modes since I was not able to capture any videos for the lighting modes that are moving.","link":"/Obins-Anne-Pro-60-Lighting-Modes/"},{"title":"Obins Anne Pro 60 + SA Cyan? (Keysets Combined)","text":"Got bored a few weeks ago and combined 2 SA keysets on my Anne Pro.. I had SA Nantucket alphas and SA PuLse modifiers… I call it SA Cyan.. Thoughts? Leave a comment :)","link":"/Obins-Anne-Pro-60-SA-Cyan-Keysets-Combined/"},{"title":"Obins Anne Pro 60 + SA Nantucket Selectric","text":"This is just the combination I came up with when I tried the SA Nantuckets on my Anne Pro.. Tell me what you think by leaving a comment. Hope you guys like it","link":"/Obins-Anne-Pro-60-SA-Nantucket-Selectric/"},{"title":"Obins Anne Pro GMK Carbon","text":"I just had to do it. I did not use the stock keycaps that came with the keyboard and installed put in a set of my GMK Carbons. For some reason or another this GMK set seems to match every keyboard that I own. I am happy with the results on how it looks like now. Hope you enjoy it!","link":"/Obins-Anne-Pro-GMK-Carbon/"},{"title":"Philippines Mechanical Keyboard Community Forums","text":"With the slowly growing community of mechanical keyboard users in the Philippines.. I decided to create a small forum so we can have a venue for discussion that is solely specific to mechanical keyboards. Hopefully it grows to a big community specially now that a lot of cheap and affordable entry level mechanical keyboards are coming out of China. If you are a Filipino and is into this mechanical keyboard hobby.. Do join us. Register and join the community. MechkeyboardPH","link":"/Philippines-Mechanical-Keyboard-Community-Forums/"},{"title":"Plex + Playstation 4 + Malaysia &#x3D; Fail","text":"I normally use my desktop tower to watch my HD movies on my TV. A few weeks back I decided to move my desktop to my desk and use it like a regular desktop with a regular monitor since I was having a hard time using it as a normal computer with this 40” LCD TV in front of me and it makes my eyes hurt. Before I moved the desktop I already knew that I will be having issues watching my movies on my tv. I do not have any long ass HDMI cable to connect the tower to my tv and besides I do not want a long ass cable going across the room just for this. I know I have options: Buy a low power cpu or maybe a raspberry pi 3 for that purpose and use plex of some sort Buy a NAS drive and have it connected to my network Use my Playstation 4 which is connected to my network to stream movies from my desktop when I want to via plex I chose the latter not knowing that everything will suck. So I went on a google spree to get information on how to make this work. I read a lot of people having success with this setup and so I thought I will have the same result. I researched for hours only to find out that the plex app for PS4 is not available from the playstation 4 in Malaysia (well that sucks) Ok now I have another bright idea, why won’t I just access my local plex media server via the playstation 4 browser…… (that sucks some more) as it turns out plex media server browsing is not support by the playstation 4 built-in browser (GOD DAMN IT!!!!) Now I will need to think of something to make this work with the hardware that I already have. I do not want to spend anything just to make this possible. If you guys have any idea please share in the comments section below. Thanks","link":"/Plex-Playstation-4-Malaysia-Fail/"},{"title":"Poker 3 + Tex Case + GMK Carbon","text":"This trio combination really looks good to me. I used this for a week at the office and everyone was asking me about the keyboard, unfortunately when I informed them how much the whole thing cost, no one became interested anymore. Takl about LOL!","link":"/Poker-3-Tex-Case-GMK-Carbon/"},{"title":"Poker 3 + Tex Case + SA Carbon","text":"The pok3r really feels good when used with SA profile keycaps. The MX Browns maybe scratchier reds but I really like that feels. Below are some shots with the pok3r using my Carbon SA keycaps","link":"/Poker-3-Tex-Case-SA-Carbon/"},{"title":"Poker 3 + Tex Case + SA Industrial","text":"My MX Brown Poker 3 using SA Industrial. SA Industrial is uniform R3, PBT key caps from Signature plastics. The key set for me is underrated. It does feel very nice and it feels good to type on. Not sure why there is not much demand for it from the used/aftermarket websites. It did sell out from PMK’s website from what I understand but it should come up for sale from time to time.","link":"/Poker-3-Tex-Case-SA-Industrial/"},{"title":"Poker 3 + Tex Case + SA PuLse","text":"Another keyboard album this time my SA PuLse keycaps on my pok3r rb keyboard. Really nice to type on mx browns using SA profile. Not too many people like the feel but I like it and it matches the scratchy MX Browns, this switch is just the way I like it","link":"/Poker-3-Tex-Case-SA-PuLse/"},{"title":"Poker 3 + Tex Case","text":"I decided to take out my old 60% out which is my Poker 3 with cherry mx browns housed in a Tex Aluminum case. Unfortunately I am not able to find the original box which also contained the tex case aluminum feet :(. Guess I will have to buy a new set of feet from /r/mechmarket or try to buy them from case directly, maybe after the Chinese new year since most Chinese around the world is on vaction mode now.","link":"/Poker-3-Tex-Case/"},{"title":"Quickfire Stealth with GMK Carbon","text":"Hmmmm I am not sure about this combination. I transferred the GMK Carbon TKL set to my Quickfire Stealth with green switches and for some reason I am having a hard time typing fast with good accuracy. I can type fast but I observed that I would need to hit the backspace key more often than I should. I think I am not for this Cherry profile and clicky switches combination. I did not have this issue when I had the set on my QFR with cherry mx blacks. I moved over the Taihao yellow/blue keycaps to my QFR and another strange thing is I am liking it and I like typing on that thing more than the greens with GMK. I think I just realized something, I think I am more of a linear type of guy. I noticed during the time I went to buy my Taihao keycaps from a local gaming store they had the IKBC F87 RGB with cherry mx switches on display and I was able to try it out and man was it good. I like typing on that thing soft and the lights. I think I should get a board with Cherry MX Reds. On a side note I am really getting addicted to this keycaps game and been surfing a lot for available rare keycaps… I just hope I did not dig a hole I cannot get out of but looking at the bright side if you get the keycaps they become more rare and valuable plus the value does not really go down but really goes up not unless ofcourse they manufacture the same color way again but I do not think they will in the near future. I heard SP, GMK or other manufacturer have been all booked probably until December of 2017 so who knows.","link":"/Quickfire-Stealth-with-GMK-Carbon/"},{"title":"Repainting CM Storm Quickfire Rapid","text":"Finally had the time to paint my CM Storm Quickfire Rapid top case. I had this all planned out when I ordered new keycaps from TaoBao but didn’t really had the time when the caps arrived. My QFR is already 4 years old and the top case and keys have seen much better days but the Cherry MX switches all still work fine though. My previous posts will show the condition of the top case if you guys would like to see. Before I begin with the steps I took to paint my case, I would like to note that I am not preaching this as the only and perfect method. You are free to check other methods from other websites or youtube. With my experience with painting cars (no I do not paint it but I get to talk and work with some car painters) I tried to follow some methods used in car painting. Another thing before I start with the steps. Please make sure to check on how to open up your mechanical keyboard since every keyboard is different. This will also void the warranty for your keyboard if it is still inside warranty. So only do this when you are sure you want to give up the warranty for your board. If you want the specific steps go jump near the end of the post. So here is my weapon of choice. 400 grit sandpaper 600 grit sandpaper 1000 grit sandpaper Plastic paint primer Color paint Top coat So for this job I went with a base color instead of a plastic primer. Normally I would go with a plastic primer but it was hard to find one in my area, so I went ahead and got a flat white paint. The description says its a paint+primer which means this does not need any primer before application + I can use this as a base coat before I apply the main color that I want. I chose Samurai as my color paint and top coat because it was cheap and that is the only brand in my area that has the blue shade that I was looking for and it was also the only brand that had clear matte top coat. When painting anything one of the things you will learn is that paint is only as good as your preparation. Do not hurry up things and do not cut corners if you don’t have to. Here are samples of how it looks like after coats Here are the steps I performed for this job Note Please make sure to put masking tap on the inside part of the case making sure to cover up the tabs and the side. If not it will be hard for you to fit the top cover back to the base since the side will accumulate paint. Dismantle the top cover Wet sanded the top cover using 400 grit sandpaper. Careful not too put too much pressure. You want to make sure that the plastic does not get deformed. Finished off sanding using 600 grit sandpaper again wet sand Let is dry for 30 mins Applied base coat/primer. I did this by applying thin coats making sure everything gets painted in every pass. I did 3 layers with 10-15 mins interval for each pass (the time really depends on the paint you are using). Let it dry Wet sanded the cover using 1000 grit sandpaper to smoothen the texture and make sure there are no uneven paint Let it dry for 30 mins Applied the color paint. I did 4 layers with 15-20 mins interval for each pass (my paint can says it should be 30 mins interval). Make sure each pass covers everything including the corners. Let it dry. Again I wet sanded with 1000 grit sandpaper after the 2nd coat and then proceeded with the 3rd and 4th coats. Applied top coat clear matt. I did 4 layers with 20-30 mins interval (this time I followed instructions from the paint can). I did thin to medium layers with fast strokes because I wanted to achieve a textured matt finish. After the 4th layer of top coat. I let it dry for 2 days without touching it. Again this is my method and I hope it works for you. I posted photos of the results and if they are satisfactory for you then you can follow the steps that I did. To see the photos of the worklog, please see album below Quickfire Rapid Repaint","link":"/Repainting-CM-Storm-Quickfire-Rapid/"},{"title":"Rocket Bunny Scion FRS (Japan)","text":"The bunny that started all the rockets. Thanks to Speedhunters for the nice photo below. This is an old video once again done by one of my favorite channel. I know it’s old but if you haven’t seen this, thank me later or post in the comments :)","link":"/Rocket-Bunny-Scion-FRS-Japan/"},{"title":"SA Industrial","text":"Recently I was able to acquire my first PBT SA profile key set. It is in uniform R3. I believe this came before SA Ice Caps. This is PBT from Signature Plastics. Unlike most of the SA key sets that I had, this one is quite unique. It does not come with any shine and its matte finish. Really nice to type on these and I am quite liking it. If its true PBT, I believe this should not produce any shine for a very long time.","link":"/SA-Industrial/"},{"title":"SA Nantucket Selectric","text":"After getting shipped to the Philippines, my keyset has finally arrived and just at the right time before Christmas. Apparently my mistake when I placed the order, I was informed by Zack from Clueboard that I may have chosen the Philippines when I paid for my order. Shipping should have just taken 2 weeks max but it took almost a month before I got it. It could have taken longer if the keyset was shipped back to the US from the Philippines. Not really sure how Zack did it be he said he opened up a ticket with USPS (maybe they contacted the local post office in the Philippines to have it shipped to Malaysia) I am really starting to love this SA profile.. It is now installed in my CM Quickfire Rapid with MX Blacks and the switches now feel much better and is softer compare to using cherry or oem profile. Maybe the added size and weight of the caps does help. I will be making another post with photos of the keys installed on the keyboard. I’ve had to mix and match the add-ons, man the struggle is real when you have 2 different add-ons to choose from but I am loving it and I am loving the sound of my keyboard now with and without the stand off feet. My only gripe with the TKL base set is that it does not come with any default homing keys, not that it matters since I got used to type touching and my fingers find the F/J keys automatically but here are times they tend to look for the bump. I just didn’t want to spend the extra cash on the homing keys addon since I just be using 2 keys from it and everything else will be unused.","link":"/SA-Nantucket-Selectric/"},{"title":"SA Oblivion Keycaps... Show your support","text":"If you like the keycaps set cast your vote so that massdrop can pick this up and have this manufactured and dropped. SA Oblivion","link":"/SA-Oblivion-Keycaps-Show-your-support/"},{"title":"SA Penumbra + Sa PuLse","text":"What happens when you combine SA Penumbra and SA PuLse. There is my take. The board I used is a Varmilo VA87M using the original blue plastic case. There are 2 combinations SA Pulse alphas + SA Solarized modifiers and SA Solarized alphas + SA Pulse modifiers. I guess it turned pretty ok. Some people love it and some people hate it when I posted photos on reddit Please take note that I did this the fastest way I can….. sooo some keys might not be in the correct location as they should.","link":"/SA-Penumbra-Sa-PuLse/"},{"title":"Sayonara Tarantula","text":"My tarantulas need to go. I need to free up space in my room since I am sharing it with my girlfriend. Another factor is its pretty hard to find food for them, at least where I live. Tarantulas are really not hard to take care of and their up keep is really cheap. Initial cost might be high for the terrarium and cocopeat and stuff but there are cheaper plastic alternatives you can use. Once they are inside their terrariums, all you need to make sure is they have water in the water dish and feed them. They do not really eat too much since they do not move a lot their metabolism is quite slow. Tarantulas are also known to go on for days without food. Perfect example is my Grammostola Rosea which only eats once a month. If you check in google, this is not an unusual behavior for these species. The only issue I have with their food is that meal worms, crickets, roaches is really hard to find from where I am at. I of course do not want to take care of a colony since I live in a condominium (imagine having a colony of crickets in your condominium balcony, I am pretty sure every neighbor that you have will go and complain to the building admin). When I do get the time to buy crickets or meal worm, the rest of them just die before I feed my T’s again since they do not really eat everyday and I only have 3 of them. Well I hope I can find someone to adopt them and take care of them. The G. Rosea I will miss the most since she is pretty docile and she is the only one I can really handle without having to be afraid that she might be me. Below are photos of my T’s Brachypelma Smithi a.k.a Mexican Red Knee Grammostola Rosea a.k.a. Chilean Rose Phormictopus cancerides a.k.a. Haitian Brown","link":"/Sayonara-Tarantula/"},{"title":"Site Layout Updated","text":"It’s been a while since I worked on this website. I’ve been busy with a lot of things (like I wasn’t able to post or update anything for more than 1 year). Recently had the to work on this website again and decided to update the layout and look. Hopefully it renders well for everyone. I tried this with all common browsers and may phone and it seems to be working fine. Hopefully I can update more often. With what’s going on with the world recently since the start of 2020, I hope everyone stays safe.","link":"/Site-Layout-Updated/"},{"title":"Sold the Fuhlen Keyboard...","text":"A few weeks ago I sold the Fuhlen Kailh Blue switch keyboard that I bought recently. It’s not because I didn’t like it but because I want to try something else. As my previous posts, I do own a first generation CM Storm Quickfire Rapid with Cherry MX black switches and overtime the switches get stiff. I am not sure if that is a characteristic of the cherry mx blacks but I am sure it was not this stiff when I first bought it 3-4 years ago. I got so used to it that the blues really felt so soft for my fingers. Do take note that I use my mx blacks on a daily basis at work that means 8 hours a day, 5 days a week. So I was at the mall last weekend and got the chance to test the following: cherry brown, green, black, red, and blue… and I am pretty sure when I tested the mx blacks they were not as hard as my current blacks. I tried out the browns which I initially planned to get to replace the fuhlen (either cherry mx brown or gateron browns) but they again felt so soft for me and I did not feel the bump I am looking for when I press the keys. The reds? Forget about it, I didn’t really like it in the first place. Then I tested the cherry mx greens.. not only are clicks/bump/actuation more pronounced compared to the blues, they are louder as well but the most important thing I liked about is the BUMP… yes I can feel the bump and the resistance was not as soft as the blues and browns and a tad bit lower than my current blacks. I fell in love. What I notice is that I like keyboards where the bump/actuation are pronounced. I have used membrane keyboards and most of them have this certain bump feeling when using. I do own a Rapoo membrane keyboard that feels like a laptop keyboard and I use it every once in a while (actually using it now typing this post since I have my QFR in the office) and I like typing in this keyboard I can really feel the bump/actuation. I did find a good deal for a used but not abused CM Storm QFR Stealth with cherry mx greens and I settled on getting it… I did find that I don’t really pay too much attention with the RGB/Backlit feature of my Fuhlen. I only notice it when I am not really using the keyboard to type anything. It does feel like I am missing something when I use my QFR non backlit but then again I don’t really have enough dough to cash out for something that is RGB at the moment. There will always be another time for it. If you have comments with cherry mx greens or any mx compatible greens leave a comment.","link":"/Sold-the-Fuhlen-Keyboard/"},{"title":"Sound Test: CM Storm Quickfire Rapid Cherry MX Blacks","text":"Before anything please remember that this is raw video/audio I did not edit anything and I just used my iphone 6 to take this video so it might not sound professional for everyone. The thumbnail is the keyboard I used for this video CM Storm Quickfire Rapid Cherry MX Black switches sound test. Take note the keyboard is 5 years old and the switches have gone from stiff to stiffer now maybe due to the age. I am using thick pbt keycaps I bought from Taobao","link":"/Sound-Test-CM-Storm-Quickfire-Rapid-Cherry-MX-Blacks/"},{"title":"Sound Test: CM Storm Quickfire Stealth Cherry MX Greens","text":"Before anything please remember that this is raw video/audio I did not edit anything and I just used my iphone 6 to take this video so it might not sound professional for everyone. The thumbnail is the keyboard I used for this video CM Storm Quickfire Stealth Cherry MX Green switches sound test. The keys do sound louder than the blues. It is definitely stiffer than the blues but it feels just about right not too soft not too hard. My Cherry MX Blacks in another video is stiffer than this so don’t get fooled by paper specifications you see online I am using thick pbt keycaps.","link":"/Sound-Test-CM-Storm-Quickfire-Stealth-Cherry-MX-Greens/"},{"title":"Sound Test: Ganss GK87 Pro Cherry MX Brown","text":"So I got a hold of a keyboard from China. The Ganss GK87 Pro. It comes with RGB under glow unfortunately it is not programmable but there are several available lighting modes. The keys only has back lit ice blue color which is ok with me. The board is light but it feels solidly built. It comes with geniune Cherry MX Brown switches. The board really feels nice to type on using the stock pbt backlit keycaps. I the stabilizers on this thing is much much better compared to my Cooler Master Masterkeys Pro S which was very ratly specially the backspace key and the right shift key. Not sure how they did it but the box says the stabilizers has been tuned. It was tuned just the way I like it. Almost feels like the stabilizers feel the same way as my pok3r with cherry mx browns. I uploaded a sample typing sound test for you guys, watch it below","link":"/Sound-Test-Ganss-GK87-Pro-Cherry-MX-Brown/"},{"title":"Sound Test: Danger Zone SA + Keycool TKL Cherry MX Red","text":"Here is a quick sound test Uniform R3 SA on Cherry MX Red. Cheapo board","link":"/Sound-Test-Danger-Zone-SA-Keycool-TKL-Cherry-MX-Red/"},{"title":"Sound Test: Ganss GK87 Pro + DSA Dolch","text":"I have sold this set recently might as well post a typing sound video here. DSA on this keyboard feels good and the switches really sound snappy. I have posted a review about this keyboard a few months back. This Ganss has one of the best stabilizers I’ve used and from my opinion has better stabilizers compared to CM Masterkeys Pro S.","link":"/Sound-Test-Ganss-GK87-Pro-DSA-Dolch/"},{"title":"Sound Test: KBD75 JTK Debut (PoW) Typing Test","text":"So I installed my old JTK Debut on my KBD75 with gateron browns. And as the usual me, I did a typing sound test. I am really used to high profile keycaps (OEM profile and above) so please don’t mind the slow typing speed as I am still getting used to cherry profile. I have used cherry profile before but I feel like that they are too low and I am having a hard time typing as fast as I type on SA profile keycaps.","link":"/Sound-Test-KBD75-JTK-Debut-PoW-Typing-Test/"},{"title":"Sound Test: KBD75 Oco Modern Beige Purple Hangul Typing Test","text":"Hope you guys enjoy the video and hopefully it provides information on how this combination sounds like","link":"/Sound-Test-KBD75-Oco-Modern-Beige-Purple-Hangul-Typing-Test/"},{"title":"Sound Test: Leopold FC660M Cherry MX Brown + MT3 Godspeed","text":"Sound test all stock Leopold FC660M Cherry MX Brown MT3 Godspeed Keycaps","link":"/Sound-Test-Leopold-FC660M-Cherry-MX-Brown-MT3-Godspeed/"},{"title":"Sound Test: Leopold FC660M Cherry MX Brown","text":"Sound test all stock Leopold FC660M Cherry MX Brown Stock Doubleshot Thick PBT Keycaps","link":"/Sound-Test-Leopold-FC660M-Cherry-MX-Brown/"},{"title":"Sound Test: Pok3r + Tex Case + SA Industrial","text":"I made this a while back and forgot about it.. So I am posting it now in case anyone wants to hear how it sounds.","link":"/Sound-Test-Pok3r-Tex-Case-SA-Industrial/"},{"title":"Sound Test: TX-CP Vintage Brown 64g springs Modern Beige PBT","text":"I used my Oco Modern Beige Purple Hangul as my first keyset of choice for my TX-CP. The sound before I believe is still different from how it sounds now since the springs and switches have since broken in. But just to give you guys an idea on how it sounds like on newly built Vintage cherry mx brown with 64g korean springs. The keyboard is still kinda quite so you may have to turn up the volume for this one","link":"/Sound-Test-TX-CP-Vintage-Brown-64g-springs-Modern-Beige-PBT/"},{"title":"Sound Test: TX-CP Vintage Brown 64g springs SA Godspeed","text":"The switches have really been broken it after using the keyboard for 2 months as my main home board. I have since then switched to SA Godspeed keycaps. I really like how it sounds now. The sound sculptured SA profile produces is really to my liking, probably one of the reason why I want to use the profile so much.","link":"/Sound-Test-TX-CP-Vintage-Brown-64g-springs-SA-Godspeed/"},{"title":"Sound Test: Varmilo VA68M-V3 (Sword68) + MT3 Godspeed","text":"Sound test all stock Varmilo VA68M-V3 (Sword68) Full Aluminum Case Cherry MX Brown MT3 Godspeed Keycaps","link":"/Sound-Test-Varmilo-VA68M-V3-Sword68-MT3-Godspeed/"},{"title":"Sound Test: Varmilo VA68M-V3 (Sword68)","text":"Sound test all stock Varmilo VA68M-V3 (Sword68) Full Aluminum Case Cherry MX Brown Stock Doubleshot Thick PBT Keycaps","link":"/Sound-Test-Varmilo-VA68M-V3-Sword68/"},{"title":"TNC Drops 1437... Adds Armel","text":"TNC has dropped 1437 recently and has decided to go All-Filipino for the rest of the Dota 2 season. May have guessed who would be the replacement for 1437. The only clue given was that the name starts with “A”. Many have guessed it could be Abed or abeng or ab1ng etc. Many did not believe that it would be someone from Team Admiral since they were only recently created to compete for the rest of the season but as it turns out Armel was out of Admiral and now will be playing mid for TNC. With the new roster KuKu moves to 5th position support and will be the captain of the team. I will have to be honest and say that I have doubts with regards to the roster change. I am not sure how long has kuku played support or if he has practiced with a lot of heroes for the 5th position but ever since I have heard of his name, he has either played the 1 position or the 2 position. Normally he plays mid and quite an aggressive one if I may say. Frankly speaking, I think one of the weak points of TNC is their hero pool. Yeah they can play any hero but the question is how good can they play any hero. For this roster to succeed, they need to add more to their hero pool and not just adding they should know how to play other heroes properly and correctly. In any case good luck to TNC hopefully this roster change will be effective for the remainder of the season.","link":"/TNC-Drops-1437-Adds-Armel/"},{"title":"TNC Pro Team Going to Kiev","text":"Kiev Majors main qualifiers for South East Asia has just concluded. I was really hoping for 2 Filipino teams to go to Kiev but unfortunately Singapore’s Team Faceless seems to be the powerhouse in the region and they took the top spot. It was mineski vs tnc for the 2nd and last spot for Kiev. TNC turned out the stronger team among the two. Hoping for the best for TNC. I wish for a top 3 finish. If they become champions then the better. Here are the highlights","link":"/TNC-Pro-Team-Going-to-Kiev/"},{"title":"TNC Take Last Slot DAC 2018 Qualifier Slot","text":"TNC beats EE led Fnatic 2-1 to take the last spot for Dota Asia Champions 2018. Fnatic took game 1 via Abed Broodmother but TNC came back with Raven’s Gyrocopter in game 2. Game 3 was really a Fnatic no show as they were stomped by TNC with Armel showing his game on his Outworld Devourer. With the win SEA Doto will be sending Mineski and TNC to DAC 2018. DAC Asia Championship slot secured! We managed to take game 3 and we're now qualified for DAC Asia Championship! Thank you for all the support!#SummonYourStrength #Niugame #TNCDota2 #RiseofthePhoenix pic.twitter.com/T8UfwfgYlf&mdash; TNC Pro Team (@TNCProTeam) February 9, 2018","link":"/TNC-Take-Last-Slot-DAC-2018-Qualifier-Slot/"},{"title":"TX-CP Modern Beige Purple Hangul","text":"This was my first choice of keycap set to use with my TX-CP. I feel it compliments the colors of the case. Also the thick pbt feels really nice when using with this keyboard. The sound of every press sounds “crunchier” if that term ever applies to keyboards. I do have a typing video for this keyboard to give some sort of idea on how this combination sounds","link":"/TX-CP-Modern-Beige-Purple-Hangul/"},{"title":"TX-CP My first Korean Custom Keyboard","text":"I’ve had this keyboard kit for quite sometime now but did not know what switches to use on them hence I never really built it and kept it until I figure out which switches to use. That I think is one of the reasons why I bought different kind of keyboards to try and get the feel of which switch I actually like. I tried several type of switches which included an 80g R3 Zealios. In the process I found out that I really like Cherry MX Browns even when it was compared to Gateron Browns. For me Gateron Browns were really too soft and too smooth. I wanted the scratchiness of the MX Brown switches but I had problem with both cherry and gateron, both of them feel too soft for me. I tried 80g springs and they were fucking too hard to even be able to use. I did like my old Cherry MX Blacks and Greens but I had problems with them. The Greens were really hard to press and I do not like clicky switches. The blacks were perfectly fine for me but it didn’t have a subtle bump. You see most people complain about the Cherry MX Brown because they cannot really feel the bump, but not all people like the cherry mx clear or zealios bump. I think everyone has their taste for food and same goes for fingers and keyboards. For me I didn’t want linear but I didn’t want a very large bump hence I always liked browns and their subtle bump which I feel is just enough for me. That is when I had the idea to create basically a Cherry MX Black switch with a bump. I was able to acquire some vintage browns from Korea and some 64g Springs. After building the switches they were the perfect switches for me. Spring resistance is just enough and the spring enhanced the brown switch bump to a certain degree. I finally had the switches I liked to put on my TX-CP. Finally I was able to build the keyboard I always wanted with the springs I was looking for. For me this layout is just about right for home and office use. I like using the numpad for work and if I am doing some calculator stuff. I always wanted a dedicated F-Row for work as well. The size is just about right a tad bigger than a TKL but smaller than a full size keyboard. The lubed vintage browns with 64g springs seems to be the switch resistance that I have been looking for. This keyboard has just made my KBD75 look like paper in terms of overall weight. I mean the bottom of the case is even heavier than my KBD75 Hope you like my build and here are the specs TX-CP Leeku L3 Compact v1.3 PCB with RGB underglow Titanium Grey Top Silver Bottom Stainless Steel bottom weight Stainless steel plate Vintage Cherry MX Browns lubed with gap films Cherry MX Clear for the function key Cherry MX Silver with 64g springs for the space bar 64g Springs from Korea Original Cherry screw-in pcb mounted stabilizer clipped and lubed Modern Beige Purple Hangul (I plan to use my SA Godspeed set with this until I burn in the switches for a few weeks) Skull artisan from /u/vanexe from reddit White LED leds","link":"/TX-CP-My-first-Korean-Custom-Keyboard/"},{"title":"TX-CP with Maxkeys Ashen R1","text":"I traded my Modern Beige Purple Hangul PBT for a set of Maxkeys Ashen R1. I wanted to see what the fuss was about regarding maxkeys aside from of course the price and that it comes fully sculptured 1-1-2-3-4-3. I wanted this set because it matches the color scheme of my TX-CP and because of this I might take a look at other keysets using this color scheme (SA Honeywell maybe?) I can confirm that the complaints people had on reddit and other mechanical keyboard forums are correct. Beforehand I know about the “Back Space” “SHIF T” issues they had and I can live with that but what bothers me are the following: Inconsistent Legends Non-centered legends Those are the things that bothers me the most.. I mean this set the whole number row is not centered and the “1 !” key is bolder than the other keys. They also feel more hollow compared to Signature Platics keys (I know since I owned SA keycaps until now) Well for the price basically you get what you pay for","link":"/TX-CP-With-Maxkeys-Ashen-R1/"},{"title":"TX-CP with SA Godspeed","text":"I’ve decided to use my SA Godspeed set with my TX-CP. Some people might not like the combination but I think it looks good. The keycaps goes well with the color of the case. The sound is just so different compared to my modern beige thick pbt’s. So far this thing looks and feels really well and I’ve had compliments from work even from a different departments manager.","link":"/TX-CP-with-SA-Godspeed/"},{"title":"The International 2017","text":"In case you do not know yet. Today is the first day of the main stage for Dota 2’s largest yearly tournament. You can watch it live HERE So hype a lot of Filipino players in year’s tournament. Hopefully they can go better than last year. It is still a dream for a Philippine team to be a champion, hopefully this is the year but I have my doubts. I hope they prove me wrong.","link":"/The-International-2017/"},{"title":"Varmilo Sword68 (VA68M-V3) + MT3 Godspeed","text":"Since I am retiring my Leopold FC660M and I have it posted on most selling portals. I have decided to switch the keycaps on the VA68M-V3. I think it looks good since the contrast of the keycaps is on the other side of the spectrum. It makes the keycaps popout because the case is all black. It actually feels good typing on these keycaps on an all aluminum case with an aluminum plate. The sound is not as loud as SA and is a bit muffled but I am liking it so far. If you notice in my typing videos, I have now decided to do it in 2 parts. one with the stand off feet closed and one with the feet opened up. You will actually notice a sound difference. I almost always like the sound with the stand off feet closed for full aluminum boards and I normally like the feet opened up when I am using normal plastic cases. Not sure why but I am weird I guess? Anyway hope you enjoy the photos below.","link":"/Varmilo-Sword68-VA68M-V3-MT3-Godspeed/"},{"title":"Varmilo Sword68 (VA68M-V3)","text":"Unboxing Photos Here Keyboard Features 68-Key modified US ANSI Layout w/ English Legends Cherry MX Brown Switch 50 million actuations Dimensions: 341 x 108 x 50mm (with angle stands used) Dimensions: 341 x 108 x 35mm (with angle stands not used) Detachable USB A to USB C PBT Sublimated keycaps Weight: 2.5kg including packaging Made in China Whats in the box? 68-Key Mini Keyboard 2.0m USB A to USB-C cable w/ velcro wrap Extra keycaps to interchange capslock with control Keypuller Plastic PVC Cover Warranty Card This is marketed as Varmilo Sword68 but it is basically the same as the Varmilo VA68M, infact it does say the model as VA68M-V3 at the bottom label. This version came in 3 colors. Black case with black legends on dark grey keycaps Silver case with white alphas, dark gray modifiers and some CMYK keycaps such as the (ctrl, alt, shift etc) Space Gray case, black bottom with whie alphas, black legends on dark gray keycaps modifiers and blue enter and spacebar keycaps Overall I can pretty much say the quality of the keyboard is very high. Since it uses a full aluminum case, it is sturdy and heavy with very little to no flex. It also uses an brushed aluminum plate which adds to the weight. The keycaps are pbt dye sublimated keycaps which feel really nice but if you ask me I like the Leopold FC660M doubleshot pbt keycaps more. I also noticed that the height of the keycaps is a bit higher compared to the one’s that came with my FC660M which are basically cherry profile. For some reason my board came with white LED lighting. I did not find this information anywhere even on Varmilo’s website. The stabilizers I think came lubed from the factory. They are cherry style stabilizers and there is really no rattle specially on the spacebar. My Leopold FC660M has a bit of rattle specially when you press the space bar near the left or right edge. Aside from the full aluminum case (which is the main reason I bought this keyboard), the Sword68 has 2 extra keys that is not present in my FC660M and that would be the page up and page down keys. I use those 2 keys a lot for the things I do on my computer so not having those when I started using the FC660M took a lot of getting used to. One may not like how the indicator for the fuction row works. Basically you press FN+PgUP to make the number row function as F-Row and this keeps the Page Up LED on to indicate the mode your are in. If you want to use the number row as the number row, you have to press FN+PgDOWN and this will keep the Page Down LED on. Normal function like FN+number key to use it as F-Key will still work Led turnd on All in all I am very happy with the purchase and with that I will be retiring my FC600M and will be posting them for sale locally. If you have the money and want a 65-68key keyboard but don’t want to spend too much on custom keyboards or can’t be bothered to build one yourself I highly recommend this keyboard. Size Comparison between Varmilo Sword 68 and Leopold FC660M","link":"/Varmilo-Sword68-VA68M-V3/"},{"title":"Varmilo VA87M + SA Carbon","text":"For me my SA Carbon looked best when I had it paired with my Varmilo VA87M. One problem though is that SA profile does not really look that good when used with keyboards that has floating keycaps design (at least from my opinion). This specific Varmilo VA87M comes with an aluminum case from taobao and it makes the whole board very hefty and solid. This also causes typing sound to change compared to using the original plastic case.","link":"/Varmilo-VA87M-SA-Carbon/"},{"title":"Varmilo VA87M + SA Industrial","text":"Of all the key caps I have tested and used with the VA87M, I feel the SA Industrial is the best keys in terms of feel with the keyboard. This is an old setup and I have long sold both the keyboard and the key set. This Varmilo VA87M was using an aluminum case off taobao and I really felt the difference between aluminum and the original plastic case. The sound was more pronounced and solid and not hollow like when I was using the plastic case with it. The board also came with Cherry MX Brown switches with felt really great with the SA industrial set.","link":"/Varmilo-VA87M-SA-Industrial/"},{"title":"Varmilo VA87M + Taihao Olivetti + Aluminum CNC Case","text":"My Old Varmilo VA87M. I have long sold this board. I sold it bundles with the original plastic blue case, Taihao Olivetti keycaps and Aluminum CNC Case","link":"/Varmilo-VA87M-Taihao-Olivetti-Aluminum-CNC-Case/"},{"title":"What&#39;s left of my SA Profile keycaps","text":"With the release of SA Penumbra round 2.. I realized I only have 2 SA keysets left. I did not buy into the Dasher/Dancer set, 1965 set and now I might not be buying into the Penumbra set as well.. Well I am not really a group buy kinda guy since I do not really have the patience to wait for the caps to arrive. I rather buy from the 2nd hand market if I want anything that way I get the keycaps waaaay faster than group buy ofcourse I have to pay some premium for it. I only have 2 sets left PuLse SA and Carbon SA and I will not be selling these sets anytime soon.. When I started the hobby these sets were still in they IC stages and these were the 2 sets that got me hooked in to this mechanical keyboard thing. SA PuLse View post on imgur.com SA Carbon View post on imgur.com","link":"/What-s-left-of-my-SA-Profile-keycaps/"}],"tags":[{"name":"ae86","slug":"ae86","link":"/tags/ae86/"},{"name":"corolla","slug":"corolla","link":"/tags/corolla/"},{"name":"toyota","slug":"toyota","link":"/tags/toyota/"},{"name":"diecast","slug":"diecast","link":"/tags/diecast/"},{"name":"toys","slug":"toys","link":"/tags/toys/"},{"name":"AutoArt","slug":"AutoArt","link":"/tags/AutoArt/"},{"name":"1&#x2F;18","slug":"1-18","link":"/tags/1-18/"},{"name":"scale model","slug":"scale-model","link":"/tags/scale-model/"},{"name":"computers","slug":"computers","link":"/tags/computers/"},{"name":"tech","slug":"tech","link":"/tags/tech/"},{"name":"nerd","slug":"nerd","link":"/tags/nerd/"},{"name":"freebsd","slug":"freebsd","link":"/tags/freebsd/"},{"name":"bsd","slug":"bsd","link":"/tags/bsd/"},{"name":"neofetch","slug":"neofetch","link":"/tags/neofetch/"},{"name":"unix","slug":"unix","link":"/tags/unix/"},{"name":"mechanical keyboard","slug":"mechanical-keyboard","link":"/tags/mechanical-keyboard/"},{"name":"cooler master","slug":"cooler-master","link":"/tags/cooler-master/"},{"name":"masterkeys pro s","slug":"masterkeys-pro-s","link":"/tags/masterkeys-pro-s/"},{"name":"rgb keyboard","slug":"rgb-keyboard","link":"/tags/rgb-keyboard/"},{"name":"cherry mx","slug":"cherry-mx","link":"/tags/cherry-mx/"},{"name":"cherry mx brown","slug":"cherry-mx-brown","link":"/tags/cherry-mx-brown/"},{"name":"blogging","slug":"blogging","link":"/tags/blogging/"},{"name":"website","slug":"website","link":"/tags/website/"},{"name":"update","slug":"update","link":"/tags/update/"},{"name":"omglulz.wtf","slug":"omglulz-wtf","link":"/tags/omglulz-wtf/"},{"name":"gaming","slug":"gaming","link":"/tags/gaming/"},{"name":"dota 2","slug":"dota-2","link":"/tags/dota-2/"},{"name":"steam","slug":"steam","link":"/tags/steam/"},{"name":"valve","slug":"valve","link":"/tags/valve/"},{"name":"tnc pro","slug":"tnc-pro","link":"/tags/tnc-pro/"},{"name":"tnc gaming","slug":"tnc-gaming","link":"/tags/tnc-gaming/"},{"name":"cooler master quickfire","slug":"cooler-master-quickfire","link":"/tags/cooler-master-quickfire/"},{"name":"quickfire rapid","slug":"quickfire-rapid","link":"/tags/quickfire-rapid/"},{"name":"gmk","slug":"gmk","link":"/tags/gmk/"},{"name":"gmk carbon","slug":"gmk-carbon","link":"/tags/gmk-carbon/"},{"name":"custom keycaps","slug":"custom-keycaps","link":"/tags/custom-keycaps/"},{"name":"keycaps","slug":"keycaps","link":"/tags/keycaps/"},{"name":"sa carbon","slug":"sa-carbon","link":"/tags/sa-carbon/"},{"name":"signature plastics","slug":"signature-plastics","link":"/tags/signature-plastics/"},{"name":"sa nantucket selectric","slug":"sa-nantucket-selectric","link":"/tags/sa-nantucket-selectric/"},{"name":"sa pulse","slug":"sa-pulse","link":"/tags/sa-pulse/"},{"name":"custome keycaps","slug":"custome-keycaps","link":"/tags/custome-keycaps/"},{"name":"quickfire stealth","slug":"quickfire-stealth","link":"/tags/quickfire-stealth/"},{"name":"cooler master quickfire stealth","slug":"cooler-master-quickfire-stealth","link":"/tags/cooler-master-quickfire-stealth/"},{"name":"cherry mx green","slug":"cherry-mx-green","link":"/tags/cherry-mx-green/"},{"name":"masterkeys pro","slug":"masterkeys-pro","link":"/tags/masterkeys-pro/"},{"name":"quickfire","slug":"quickfire","link":"/tags/quickfire/"},{"name":"taobao","slug":"taobao","link":"/tags/taobao/"},{"name":"geek","slug":"geek","link":"/tags/geek/"},{"name":"linux","slug":"linux","link":"/tags/linux/"},{"name":"linuxmint","slug":"linuxmint","link":"/tags/linuxmint/"},{"name":"desktop","slug":"desktop","link":"/tags/desktop/"},{"name":"minimalist","slug":"minimalist","link":"/tags/minimalist/"},{"name":"cherry mx black","slug":"cherry-mx-black","link":"/tags/cherry-mx-black/"},{"name":"DIY","slug":"DIY","link":"/tags/DIY/"},{"name":"custom","slug":"custom","link":"/tags/custom/"},{"name":"dsa granite","slug":"dsa-granite","link":"/tags/dsa-granite/"},{"name":"dsa dolch","slug":"dsa-dolch","link":"/tags/dsa-dolch/"},{"name":"liquid cooling","slug":"liquid-cooling","link":"/tags/liquid-cooling/"},{"name":"AIO","slug":"AIO","link":"/tags/AIO/"},{"name":"deepcool","slug":"deepcool","link":"/tags/deepcool/"},{"name":"debian","slug":"debian","link":"/tags/debian/"},{"name":"conky","slug":"conky","link":"/tags/conky/"},{"name":"minimal","slug":"minimal","link":"/tags/minimal/"},{"name":"minimal desktop","slug":"minimal-desktop","link":"/tags/minimal-desktop/"},{"name":"computer","slug":"computer","link":"/tags/computer/"},{"name":"docky","slug":"docky","link":"/tags/docky/"},{"name":"facebook","slug":"facebook","link":"/tags/facebook/"},{"name":"tutorial","slug":"tutorial","link":"/tags/tutorial/"},{"name":"how to","slug":"how-to","link":"/tags/how-to/"},{"name":"delete facebook group","slug":"delete-facebook-group","link":"/tags/delete-facebook-group/"},{"name":"dota","slug":"dota","link":"/tags/dota/"},{"name":"dota2","slug":"dota2","link":"/tags/dota2/"},{"name":"defence of the ancient","slug":"defence-of-the-ancient","link":"/tags/defence-of-the-ancient/"},{"name":"dota asia championships 2018","slug":"dota-asia-championships-2018","link":"/tags/dota-asia-championships-2018/"},{"name":"dac 2018","slug":"dac-2018","link":"/tags/dac-2018/"},{"name":"icefrog","slug":"icefrog","link":"/tags/icefrog/"},{"name":"esports","slug":"esports","link":"/tags/esports/"},{"name":"execration","slug":"execration","link":"/tags/execration/"},{"name":"the international","slug":"the-international","link":"/tags/the-international/"},{"name":"the international 2018","slug":"the-international-2018","link":"/tags/the-international-2018/"},{"name":"tournament","slug":"tournament","link":"/tags/tournament/"},{"name":"true sight","slug":"true-sight","link":"/tags/true-sight/"},{"name":"fnatic","slug":"fnatic","link":"/tags/fnatic/"},{"name":"evil geniuses","slug":"evil-geniuses","link":"/tags/evil-geniuses/"},{"name":"eg","slug":"eg","link":"/tags/eg/"},{"name":"aghanims","slug":"aghanims","link":"/tags/aghanims/"},{"name":"mech keyboard","slug":"mech-keyboard","link":"/tags/mech-keyboard/"},{"name":"doubleshot","slug":"doubleshot","link":"/tags/doubleshot/"},{"name":"pbt","slug":"pbt","link":"/tags/pbt/"},{"name":"dota major","slug":"dota-major","link":"/tags/dota-major/"},{"name":"team execration","slug":"team-execration","link":"/tags/team-execration/"},{"name":"cars","slug":"cars","link":"/tags/cars/"},{"name":"car porn","slug":"car-porn","link":"/tags/car-porn/"},{"name":"car enthusiast","slug":"car-enthusiast","link":"/tags/car-enthusiast/"},{"name":"cargasm","slug":"cargasm","link":"/tags/cargasm/"},{"name":"racing","slug":"racing","link":"/tags/racing/"},{"name":"ferrari","slug":"ferrari","link":"/tags/ferrari/"},{"name":"italian","slug":"italian","link":"/tags/italian/"},{"name":"japanese","slug":"japanese","link":"/tags/japanese/"},{"name":"gt86","slug":"gt86","link":"/tags/gt86/"},{"name":"scion","slug":"scion","link":"/tags/scion/"},{"name":"frs","slug":"frs","link":"/tags/frs/"},{"name":"ferrari 458","slug":"ferrari-458","link":"/tags/ferrari-458/"},{"name":"site update","slug":"site-update","link":"/tags/site-update/"},{"name":"site news","slug":"site-news","link":"/tags/site-news/"},{"name":"webhosting","slug":"webhosting","link":"/tags/webhosting/"},{"name":"flat file","slug":"flat-file","link":"/tags/flat-file/"},{"name":"cms","slug":"cms","link":"/tags/cms/"},{"name":"team secret","slug":"team-secret","link":"/tags/team-secret/"},{"name":"esl one","slug":"esl-one","link":"/tags/esl-one/"},{"name":"katowice","slug":"katowice","link":"/tags/katowice/"},{"name":"dota majors","slug":"dota-majors","link":"/tags/dota-majors/"},{"name":"fuhlen sm680r","slug":"fuhlen-sm680r","link":"/tags/fuhlen-sm680r/"},{"name":"fuhlen","slug":"fuhlen","link":"/tags/fuhlen/"},{"name":"sm680r","slug":"sm680r","link":"/tags/sm680r/"},{"name":"khail blue switches","slug":"khail-blue-switches","link":"/tags/khail-blue-switches/"},{"name":"ganss","slug":"ganss","link":"/tags/ganss/"},{"name":"ganss gk87 pro","slug":"ganss-gk87-pro","link":"/tags/ganss-gk87-pro/"},{"name":"happy hacking keyboard 2","slug":"happy-hacking-keyboard-2","link":"/tags/happy-hacking-keyboard-2/"},{"name":"hhkb","slug":"hhkb","link":"/tags/hhkb/"},{"name":"type s","slug":"type-s","link":"/tags/type-s/"},{"name":"made in Japan","slug":"made-in-Japan","link":"/tags/made-in-Japan/"},{"name":"Japan","slug":"Japan","link":"/tags/Japan/"},{"name":"electro capacivite","slug":"electro-capacivite","link":"/tags/electro-capacivite/"},{"name":"abed","slug":"abed","link":"/tags/abed/"},{"name":"team onyx","slug":"team-onyx","link":"/tags/team-onyx/"},{"name":"NA Dota","slug":"NA-Dota","link":"/tags/NA-Dota/"},{"name":"hakosuka","slug":"hakosuka","link":"/tags/hakosuka/"},{"name":"skyline","slug":"skyline","link":"/tags/skyline/"},{"name":"nissan","slug":"nissan","link":"/tags/nissan/"},{"name":"Ignition Model","slug":"Ignition-Model","link":"/tags/Ignition-Model/"},{"name":"IG","slug":"IG","link":"/tags/IG/"},{"name":"jtk pow","slug":"jtk-pow","link":"/tags/jtk-pow/"},{"name":"jtk debut","slug":"jtk-debut","link":"/tags/jtk-debut/"},{"name":"jtk purple on white","slug":"jtk-purple-on-white","link":"/tags/jtk-purple-on-white/"},{"name":"cherry profile","slug":"cherry-profile","link":"/tags/cherry-profile/"},{"name":"dolch","slug":"dolch","link":"/tags/dolch/"},{"name":"gateron brown","slug":"gateron-brown","link":"/tags/gateron-brown/"},{"name":"kbdfans","slug":"kbdfans","link":"/tags/kbdfans/"},{"name":"kbd75","slug":"kbd75","link":"/tags/kbd75/"},{"name":"dsa granites","slug":"dsa-granites","link":"/tags/dsa-granites/"},{"name":"dsa","slug":"dsa","link":"/tags/dsa/"},{"name":"elven tongue","slug":"elven-tongue","link":"/tags/elven-tongue/"},{"name":"custom keyboard","slug":"custom-keyboard","link":"/tags/custom-keyboard/"},{"name":"mechkeyboardph","slug":"mechkeyboardph","link":"/tags/mechkeyboardph/"},{"name":"JT Keycaps","slug":"JT-Keycaps","link":"/tags/JT-Keycaps/"},{"name":"JTK Pow","slug":"JTK-Pow","link":"/tags/JTK-Pow/"},{"name":"Jtk debut","slug":"Jtk-debut","link":"/tags/Jtk-debut/"},{"name":"stabilizers","slug":"stabilizers","link":"/tags/stabilizers/"},{"name":"diy","slug":"diy","link":"/tags/diy/"},{"name":"lubing","slug":"lubing","link":"/tags/lubing/"},{"name":"tuning switches","slug":"tuning-switches","link":"/tags/tuning-switches/"},{"name":"keycook 87","slug":"keycook-87","link":"/tags/keycook-87/"},{"name":"sa 1976","slug":"sa-1976","link":"/tags/sa-1976/"},{"name":"tkl","slug":"tkl","link":"/tags/tkl/"},{"name":"keycool 87","slug":"keycool-87","link":"/tags/keycool-87/"},{"name":"cherry mx red","slug":"cherry-mx-red","link":"/tags/cherry-mx-red/"},{"name":"signature plasticsmechanical keyboard","slug":"signature-plasticsmechanical-keyboard","link":"/tags/signature-plasticsmechanical-keyboard/"},{"name":"sa danger zone","slug":"sa-danger-zone","link":"/tags/sa-danger-zone/"},{"name":"mechanical keyboards","slug":"mechanical-keyboards","link":"/tags/mechanical-keyboards/"},{"name":"sa penumbra","slug":"sa-penumbra","link":"/tags/sa-penumbra/"},{"name":"sa solarized","slug":"sa-solarized","link":"/tags/sa-solarized/"},{"name":"tklmechanical keyboards","slug":"tklmechanical-keyboards","link":"/tags/tklmechanical-keyboards/"},{"name":"jaguar","slug":"jaguar","link":"/tags/jaguar/"},{"name":"porsche","slug":"porsche","link":"/tags/porsche/"},{"name":"japan","slug":"japan","link":"/tags/japan/"},{"name":"leopold","slug":"leopold","link":"/tags/leopold/"},{"name":"fc660m","slug":"fc660m","link":"/tags/fc660m/"},{"name":"mx brown","slug":"mx-brown","link":"/tags/mx-brown/"},{"name":"keyboard","slug":"keyboard","link":"/tags/keyboard/"},{"name":"mt3","slug":"mt3","link":"/tags/mt3/"},{"name":"mt3 godspeed","slug":"mt3-godspeed","link":"/tags/mt3-godspeed/"},{"name":"godspeed","slug":"godspeed","link":"/tags/godspeed/"},{"name":"dell","slug":"dell","link":"/tags/dell/"},{"name":"laptop","slug":"laptop","link":"/tags/laptop/"},{"name":"5521","slug":"5521","link":"/tags/5521/"},{"name":"inspiron","slug":"inspiron","link":"/tags/inspiron/"},{"name":"fan","slug":"fan","link":"/tags/fan/"},{"name":"mazda","slug":"mazda","link":"/tags/mazda/"},{"name":"mx5","slug":"mx5","link":"/tags/mx5/"},{"name":"mazda miata","slug":"mazda-miata","link":"/tags/mazda-miata/"},{"name":"restoration","slug":"restoration","link":"/tags/restoration/"},{"name":"mx-5","slug":"mx-5","link":"/tags/mx-5/"},{"name":"modern beige","slug":"modern-beige","link":"/tags/modern-beige/"},{"name":"thick pbt","slug":"thick-pbt","link":"/tags/thick-pbt/"},{"name":"originative","slug":"originative","link":"/tags/originative/"},{"name":"mercedez-benz","slug":"mercedez-benz","link":"/tags/mercedez-benz/"},{"name":"esl gaming","slug":"esl-gaming","link":"/tags/esl-gaming/"},{"name":"esl","slug":"esl","link":"/tags/esl/"},{"name":"obins","slug":"obins","link":"/tags/obins/"},{"name":"anne pro","slug":"anne-pro","link":"/tags/anne-pro/"},{"name":"anne pro 60","slug":"anne-pro-60","link":"/tags/anne-pro-60/"},{"name":"60% keyboard","slug":"60-keyboard","link":"/tags/60-keyboard/"},{"name":"mechkeyboardph.com","slug":"mechkeyboardph-com","link":"/tags/mechkeyboardph-com/"},{"name":"mechanical keyboard philippines","slug":"mechanical-keyboard-philippines","link":"/tags/mechanical-keyboard-philippines/"},{"name":"community","slug":"community","link":"/tags/community/"},{"name":"playstation 4","slug":"playstation-4","link":"/tags/playstation-4/"},{"name":"ps4","slug":"ps4","link":"/tags/ps4/"},{"name":"plex","slug":"plex","link":"/tags/plex/"},{"name":"fail","slug":"fail","link":"/tags/fail/"},{"name":"pok3r","slug":"pok3r","link":"/tags/pok3r/"},{"name":"poker 3","slug":"poker-3","link":"/tags/poker-3/"},{"name":"tex","slug":"tex","link":"/tags/tex/"},{"name":"aluminum case","slug":"aluminum-case","link":"/tags/aluminum-case/"},{"name":"60%  keyboard","slug":"60-keyboard","link":"/tags/60-keyboard/"},{"name":"sa industrial","slug":"sa-industrial","link":"/tags/sa-industrial/"},{"name":"signature plasticmechanical keyboard","slug":"signature-plasticmechanical-keyboard","link":"/tags/signature-plasticmechanical-keyboard/"},{"name":"signature plastic","slug":"signature-plastic","link":"/tags/signature-plastic/"},{"name":"customer keycaps","slug":"customer-keycaps","link":"/tags/customer-keycaps/"},{"name":"keycapsmechanical keyboard","slug":"keycapsmechanical-keyboard","link":"/tags/keycapsmechanical-keyboard/"},{"name":"rocket bunny","slug":"rocket-bunny","link":"/tags/rocket-bunny/"},{"name":"slammed","slug":"slammed","link":"/tags/slammed/"},{"name":"custom keycap","slug":"custom-keycap","link":"/tags/custom-keycap/"},{"name":"nantucket selectric","slug":"nantucket-selectric","link":"/tags/nantucket-selectric/"},{"name":"sa oblivion","slug":"sa-oblivion","link":"/tags/sa-oblivion/"},{"name":"varmilo","slug":"varmilo","link":"/tags/varmilo/"},{"name":"va87m","slug":"va87m","link":"/tags/va87m/"},{"name":"tarantula","slug":"tarantula","link":"/tags/tarantula/"},{"name":"spiders","slug":"spiders","link":"/tags/spiders/"},{"name":"arachnophobia","slug":"arachnophobia","link":"/tags/arachnophobia/"},{"name":"nature","slug":"nature","link":"/tags/nature/"},{"name":"pets","slug":"pets","link":"/tags/pets/"},{"name":"omglulz news","slug":"omglulz-news","link":"/tags/omglulz-news/"},{"name":"khail mx blue switches","slug":"khail-mx-blue-switches","link":"/tags/khail-mx-blue-switches/"},{"name":"typing sound test","slug":"typing-sound-test","link":"/tags/typing-sound-test/"},{"name":"rgb","slug":"rgb","link":"/tags/rgb/"},{"name":"underglow","slug":"underglow","link":"/tags/underglow/"},{"name":"jtk","slug":"jtk","link":"/tags/jtk/"},{"name":"debut","slug":"debut","link":"/tags/debut/"},{"name":"typing test","slug":"typing-test","link":"/tags/typing-test/"},{"name":"sound test","slug":"sound-test","link":"/tags/sound-test/"},{"name":"gateron","slug":"gateron","link":"/tags/gateron/"},{"name":"pbt keycaps","slug":"pbt-keycaps","link":"/tags/pbt-keycaps/"},{"name":"typing sound","slug":"typing-sound","link":"/tags/typing-sound/"},{"name":"leopold fc660m","slug":"leopold-fc660m","link":"/tags/leopold-fc660m/"},{"name":"tx-cp","slug":"tx-cp","link":"/tags/tx-cp/"},{"name":"txcp","slug":"txcp","link":"/tags/txcp/"},{"name":"korean custom","slug":"korean-custom","link":"/tags/korean-custom/"},{"name":"vintage cherry mx brown","slug":"vintage-cherry-mx-brown","link":"/tags/vintage-cherry-mx-brown/"},{"name":"64g springs","slug":"64g-springs","link":"/tags/64g-springs/"},{"name":"springs","slug":"springs","link":"/tags/springs/"},{"name":"keyboard typing test","slug":"keyboard-typing-test","link":"/tags/keyboard-typing-test/"},{"name":"sound","slug":"sound","link":"/tags/sound/"},{"name":"typing","slug":"typing","link":"/tags/typing/"},{"name":"cherry mx brown vintage","slug":"cherry-mx-brown-vintage","link":"/tags/cherry-mx-brown-vintage/"},{"name":"sword68","slug":"sword68","link":"/tags/sword68/"},{"name":"va68m-v3","slug":"va68m-v3","link":"/tags/va68m-v3/"},{"name":"va68m","slug":"va68m","link":"/tags/va68m/"},{"name":"MT3 keycaps","slug":"MT3-keycaps","link":"/tags/MT3-keycaps/"},{"name":"full aluminum keyboard","slug":"full-aluminum-keyboard","link":"/tags/full-aluminum-keyboard/"},{"name":"kiev major","slug":"kiev-major","link":"/tags/kiev-major/"},{"name":"Dota Asia Championships 2018","slug":"Dota-Asia-Championships-2018","link":"/tags/Dota-Asia-Championships-2018/"},{"name":"Dota Asia Championships","slug":"Dota-Asia-Championships","link":"/tags/Dota-Asia-Championships/"},{"name":"dota qualifier","slug":"dota-qualifier","link":"/tags/dota-qualifier/"},{"name":"modern beige purple","slug":"modern-beige-purple","link":"/tags/modern-beige-purple/"},{"name":"TX keyboards","slug":"TX-keyboards","link":"/tags/TX-keyboards/"},{"name":"maxkeys","slug":"maxkeys","link":"/tags/maxkeys/"},{"name":"ashren","slug":"ashren","link":"/tags/ashren/"},{"name":"maxkeys ashen","slug":"maxkeys-ashen","link":"/tags/maxkeys-ashen/"},{"name":"sa godspeed","slug":"sa-godspeed","link":"/tags/sa-godspeed/"},{"name":"the international 2017","slug":"the-international-2017","link":"/tags/the-international-2017/"},{"name":"TI7","slug":"TI7","link":"/tags/TI7/"},{"name":"vamilo","slug":"vamilo","link":"/tags/vamilo/"},{"name":"taihao","slug":"taihao","link":"/tags/taihao/"},{"name":"olivetti","slug":"olivetti","link":"/tags/olivetti/"},{"name":"cnc aluminum case","slug":"cnc-aluminum-case","link":"/tags/cnc-aluminum-case/"},{"name":"sa profile keycaps","slug":"sa-profile-keycaps","link":"/tags/sa-profile-keycaps/"},{"name":"SA PuLse","slug":"SA-PuLse","link":"/tags/SA-PuLse/"},{"name":"SA Carbon","slug":"SA-Carbon","link":"/tags/SA-Carbon/"}],"categories":[]}